robertlipe/svdtoheaders/demo/h/ch32v20x_reg.h
/* CAN1 - Controller area network */
#define CH32V203_CAN1_BASE                0x40006400
#define CH32V203_CAN1_CTLR_OFFSET         0x0000
#define CH32V203_CAN1_CTLR                (CH32V203_CAN1_BASE + CH32V203_CAN1_CTLR_OFFSET) /* read-write */
#define CH32V203_CAN1_CTLR_DBF            (1 << 16) /* 00010000: Debug freeze */
#define CH32V203_CAN1_CTLR_RESET          (1 << 15) /* 00008000: Software master reset */
#define CH32V203_CAN1_CTLR_TTCM           (1 <<  7) /* 00000080: Time triggered communication mode */
#define CH32V203_CAN1_CTLR_ABOM           (1 <<  6) /* 00000040: Automatic bus-off management */
#define CH32V203_CAN1_CTLR_AWUM           (1 <<  5) /* 00000020: Automatic wakeup mode */
#define CH32V203_CAN1_CTLR_NART           (1 <<  4) /* 00000010: No automatic retransmission */
#define CH32V203_CAN1_CTLR_RFLM           (1 <<  3) /* 00000008: Receive FIFO locked mode */
#define CH32V203_CAN1_CTLR_TXFP           (1 <<  2) /* 00000004: Transmit FIFO priority */
#define CH32V203_CAN1_CTLR_SLEEP          (1 <<  1) /* 00000002: Sleep mode request */
#define CH32V203_CAN1_CTLR_INRQ           (1 <<  0) /* 00000001: Initialization request */
#define CH32V203_CAN1_STATR_OFFSET        0x0004
#define CH32V203_CAN1_STATR               (CH32V203_CAN1_BASE + CH32V203_CAN1_STATR_OFFSET)
#define CH32V203_CAN1_STATR_RX            (1 << 11) /* 00000800: Rx signal */
#define CH32V203_CAN1_STATR_SAMP          (1 << 10) /* 00000400: Last sample point */
#define CH32V203_CAN1_STATR_RXM           (1 <<  9) /* 00000200: Receive mode */
#define CH32V203_CAN1_STATR_TXM           (1 <<  8) /* 00000100: Transmit mode */
#define CH32V203_CAN1_STATR_SLAKI         (1 <<  4) /* 00000010: Sleep acknowledge interrupt */
#define CH32V203_CAN1_STATR_WKUI          (1 <<  3) /* 00000008: Wakeup interrupt */
#define CH32V203_CAN1_STATR_ERRI          (1 <<  2) /* 00000004: Error interrupt */
#define CH32V203_CAN1_STATR_SLAK          (1 <<  1) /* 00000002: Sleep acknowledge */
#define CH32V203_CAN1_STATR_INAK          (1 <<  0) /* 00000001: Initialization acknowledge */
#define CH32V203_CAN1_TSTATR_OFFSET       0x0008
#define CH32V203_CAN1_TSTATR              (CH32V203_CAN1_BASE + CH32V203_CAN1_TSTATR_OFFSET)
#define CH32V203_CAN1_TSTATR_LOW2         (1 << 31) /* 80000000: Lowest priority flag for mailbox 2 */
#define CH32V203_CAN1_TSTATR_LOW1         (1 << 30) /* 40000000: Lowest priority flag for mailbox 1 */
#define CH32V203_CAN1_TSTATR_LOW0         (1 << 29) /* 20000000: Lowest priority flag for mailbox 0 */
#define CH32V203_CAN1_TSTATR_TME2         (1 << 28) /* 10000000: Transmit mailbox 2 empty */
#define CH32V203_CAN1_TSTATR_TME1         (1 << 27) /* 08000000: Transmit mailbox 1 empty */
#define CH32V203_CAN1_TSTATR_TME0         (1 << 26) /* 04000000: Transmit mailbox 0 empty */
#define CH32V203_CAN1_TSTATR_CODE         (0x3 << 24) /* 03000000: Mailbox code */
#define CH32V203_CAN1_TSTATR_CODE_MASK    (0x3 << 24)
#define CH32V203_CAN1_TSTATR_ABRQ2        (1 << 23) /* 00800000: Abort request for mailbox 2 */
#define CH32V203_CAN1_TSTATR_TERR2        (1 << 19) /* 00080000: Transmission error of mailbox 2 */
#define CH32V203_CAN1_TSTATR_ALST2        (1 << 18) /* 00040000: Arbitration lost for mailbox 2 */
#define CH32V203_CAN1_TSTATR_TXOK2        (1 << 17) /* 00020000: Transmission OK of mailbox 2 */
#define CH32V203_CAN1_TSTATR_RQCP2        (1 << 16) /* 00010000: Request completed mailbox2 */
#define CH32V203_CAN1_TSTATR_ABRQ1        (1 << 15) /* 00008000: Abort request for mailbox 1 */
#define CH32V203_CAN1_TSTATR_TERR1        (1 << 11) /* 00000800: Transmission error of mailbox1 */
#define CH32V203_CAN1_TSTATR_ALST1        (1 << 10) /* 00000400: Arbitration lost for mailbox1 */
#define CH32V203_CAN1_TSTATR_TXOK1        (1 <<  9) /* 00000200: Transmission OK of mailbox1 */
#define CH32V203_CAN1_TSTATR_RQCP1        (1 <<  8) /* 00000100: Request completed mailbox1 */
#define CH32V203_CAN1_TSTATR_ABRQ0        (1 <<  7) /* 00000080: Abort request for mailbox0 */
#define CH32V203_CAN1_TSTATR_TERR0        (1 <<  3) /* 00000008: Transmission error of mailbox0 */
#define CH32V203_CAN1_TSTATR_ALST0        (1 <<  2) /* 00000004: Arbitration lost for mailbox0 */
#define CH32V203_CAN1_TSTATR_TXOK0        (1 <<  1) /* 00000002: Transmission OK of mailbox0 */
#define CH32V203_CAN1_TSTATR_RQCP0        (1 <<  0) /* 00000001: Request completed mailbox0 */
#define CH32V203_CAN1_RFIFO0_OFFSET       0x000c
#define CH32V203_CAN1_RFIFO0              (CH32V203_CAN1_BASE + CH32V203_CAN1_RFIFO0_OFFSET)
#define CH32V203_CAN1_RFIFO0_RFOM0        (1 <<  5) /* 00000020: Release FIFO 0 output mailbox */
#define CH32V203_CAN1_RFIFO0_FOVR0        (1 <<  4) /* 00000010: FIFO 0 overrun */
#define CH32V203_CAN1_RFIFO0_FULL0        (1 <<  3) /* 00000008: FIFO 0 full */
#define CH32V203_CAN1_RFIFO0_FMP0         (0x3 << 0) /* 00000003: FIFO 0 message pending */
#define CH32V203_CAN1_RFIFO0_FMP0_MASK    (0x3 << 0)
#define CH32V203_CAN1_RFIFO1_OFFSET       0x0010
#define CH32V203_CAN1_RFIFO1              (CH32V203_CAN1_BASE + CH32V203_CAN1_RFIFO1_OFFSET)
#define CH32V203_CAN1_RFIFO1_RFOM1        (1 <<  5) /* 00000020: Release FIFO 1 output mailbox */
#define CH32V203_CAN1_RFIFO1_FOVR1        (1 <<  4) /* 00000010: FIFO 1 overrun */
#define CH32V203_CAN1_RFIFO1_FULL1        (1 <<  3) /* 00000008: FIFO 1 full */
#define CH32V203_CAN1_RFIFO1_FMP1         (0x3 << 0) /* 00000003: FIFO 1 message pending */
#define CH32V203_CAN1_RFIFO1_FMP1_MASK    (0x3 << 0)
#define CH32V203_CAN1_INTENR_OFFSET       0x0014
#define CH32V203_CAN1_INTENR              (CH32V203_CAN1_BASE + CH32V203_CAN1_INTENR_OFFSET) /* read-write */
#define CH32V203_CAN1_INTENR_SLKIE        (1 << 17) /* 00020000: Sleep interrupt enable */
#define CH32V203_CAN1_INTENR_WKUIE        (1 << 16) /* 00010000: Wakeup interrupt enable */
#define CH32V203_CAN1_INTENR_ERRIE        (1 << 15) /* 00008000: Error interrupt enable */
#define CH32V203_CAN1_INTENR_LECIE        (1 << 11) /* 00000800: Last error code interrupt enable */
#define CH32V203_CAN1_INTENR_BOFIE        (1 << 10) /* 00000400: Bus-off interrupt enable */
#define CH32V203_CAN1_INTENR_EPVIE        (1 <<  9) /* 00000200: Error passive interrupt enable */
#define CH32V203_CAN1_INTENR_EWGIE        (1 <<  8) /* 00000100: Error warning interrupt enable */
#define CH32V203_CAN1_INTENR_FOVIE1       (1 <<  6) /* 00000040: FIFO overrun interrupt enable */
#define CH32V203_CAN1_INTENR_FFIE1        (1 <<  5) /* 00000020: FIFO full interrupt enable */
#define CH32V203_CAN1_INTENR_FMPIE1       (1 <<  4) /* 00000010: FIFO message pending interrupt enable */
#define CH32V203_CAN1_INTENR_FOVIE0       (1 <<  3) /* 00000008: FIFO overrun interrupt enable */
#define CH32V203_CAN1_INTENR_FFIE0        (1 <<  2) /* 00000004: FIFO full interrupt enable */
#define CH32V203_CAN1_INTENR_FMPIE0       (1 <<  1) /* 00000002: FIFO message pending interrupt enable */
#define CH32V203_CAN1_INTENR_TMEIE        (1 <<  0) /* 00000001: Transmit mailbox empty interrupt enable */
#define CH32V203_CAN1_ERRSR_OFFSET        0x0018
#define CH32V203_CAN1_ERRSR               (CH32V203_CAN1_BASE + CH32V203_CAN1_ERRSR_OFFSET)
#define CH32V203_CAN1_ERRSR_REC           (0xff << 24) /* ff000000: Receive error counter */
#define CH32V203_CAN1_ERRSR_REC_MASK      (0xff << 24)
#define CH32V203_CAN1_ERRSR_TEC           (0xff << 16) /* 00ff0000: Least significant byte of the 9-bit transmit error counter */
#define CH32V203_CAN1_ERRSR_TEC_MASK      (0xff << 16)
#define CH32V203_CAN1_ERRSR_LEC           (0x7 << 4) /* 00000070: Last error code */
#define CH32V203_CAN1_ERRSR_LEC_MASK      (0x7 << 4)
#define CH32V203_CAN1_ERRSR_BOFF          (1 <<  2) /* 00000004: Bus-off flag */
#define CH32V203_CAN1_ERRSR_EPVF          (1 <<  1) /* 00000002: Error passive flag */
#define CH32V203_CAN1_ERRSR_EWGF          (1 <<  0) /* 00000001: Error warning flag */
#define CH32V203_CAN1_BTIMR_OFFSET        0x001c
#define CH32V203_CAN1_BTIMR               (CH32V203_CAN1_BASE + CH32V203_CAN1_BTIMR_OFFSET) /* read-write */
#define CH32V203_CAN1_BTIMR_SILM          (1 << 31) /* 80000000: Silent mode (debug) */
#define CH32V203_CAN1_BTIMR_LBKM          (1 << 30) /* 40000000: Loop back mode (debug) */
#define CH32V203_CAN1_BTIMR_SJW           (0x3 << 24) /* 03000000: Resynchronization jump width */
#define CH32V203_CAN1_BTIMR_SJW_MASK      (0x3 << 24)
#define CH32V203_CAN1_BTIMR_TS2           (0x7 << 20) /* 00700000: Time segment 2 */
#define CH32V203_CAN1_BTIMR_TS2_MASK      (0x7 << 20)
#define CH32V203_CAN1_BTIMR_TS1           (0xf << 16) /* 000f0000: Time segment 1 */
#define CH32V203_CAN1_BTIMR_TS1_MASK      (0xf << 16)
#define CH32V203_CAN1_BTIMR_BRP           (0x3ff << 0) /* 000003ff: Baud rate prescaler */
#define CH32V203_CAN1_BTIMR_BRP_MASK      (0x3ff << 0)
#define CH32V203_CAN1_TXMIR0_OFFSET       0x0180
#define CH32V203_CAN1_TXMIR0              (CH32V203_CAN1_BASE + CH32V203_CAN1_TXMIR0_OFFSET) /* read-write */
#define CH32V203_CAN1_TXMIR0_STID         (0x7ff << 21) /* ffe00000: Standard identifier */
#define CH32V203_CAN1_TXMIR0_STID_MASK    (0x7ff << 21)
#define CH32V203_CAN1_TXMIR0_EXID         (0x3ffff << 3) /* 001ffff8: extended identifier */
#define CH32V203_CAN1_TXMIR0_EXID_MASK    (0x3ffff << 3)
#define CH32V203_CAN1_TXMIR0_IDE          (1 <<  2) /* 00000004: Identifier extension */
#define CH32V203_CAN1_TXMIR0_RTR          (1 <<  1) /* 00000002: Remote transmission request */
#define CH32V203_CAN1_TXMIR0_TXRQ         (1 <<  0) /* 00000001: Transmit mailbox request */
#define CH32V203_CAN1_TXMDTR0_OFFSET      0x0184
#define CH32V203_CAN1_TXMDTR0             (CH32V203_CAN1_BASE + CH32V203_CAN1_TXMDTR0_OFFSET) /* read-write */
#define CH32V203_CAN1_TXMDTR0_TIME        (0xffff << 16) /* ffff0000: Message time stamp */
#define CH32V203_CAN1_TXMDTR0_TIME_MASK   (0xffff << 16)
#define CH32V203_CAN1_TXMDTR0_TGT         (1 <<  8) /* 00000100: Transmit global time */
#define CH32V203_CAN1_TXMDTR0_DLC         (0xf << 0) /* 0000000f: Data length code */
#define CH32V203_CAN1_TXMDTR0_DLC_MASK    (0xf << 0)
#define CH32V203_CAN1_TXMDLR0_OFFSET      0x0188
#define CH32V203_CAN1_TXMDLR0             (CH32V203_CAN1_BASE + CH32V203_CAN1_TXMDLR0_OFFSET) /* read-write */
#define CH32V203_CAN1_TXMDLR0_DATA3       (0xff << 24) /* ff000000: Data byte 3 */
#define CH32V203_CAN1_TXMDLR0_DATA3_MASK  (0xff << 24)
#define CH32V203_CAN1_TXMDLR0_DATA2       (0xff << 16) /* 00ff0000: Data byte 2 */
#define CH32V203_CAN1_TXMDLR0_DATA2_MASK  (0xff << 16)
#define CH32V203_CAN1_TXMDLR0_DATA1       (0xff << 8) /* 0000ff00: Data byte 1 */
#define CH32V203_CAN1_TXMDLR0_DATA1_MASK  (0xff << 8)
#define CH32V203_CAN1_TXMDLR0_DATA0       (0xff << 0) /* 000000ff: Data byte 0 */
#define CH32V203_CAN1_TXMDLR0_DATA0_MASK  (0xff << 0)
#define CH32V203_CAN1_TXMDHR0_OFFSET      0x018c
#define CH32V203_CAN1_TXMDHR0             (CH32V203_CAN1_BASE + CH32V203_CAN1_TXMDHR0_OFFSET) /* read-write */
#define CH32V203_CAN1_TXMDHR0_DATA7       (0xff << 24) /* ff000000: Data byte 7 */
#define CH32V203_CAN1_TXMDHR0_DATA7_MASK  (0xff << 24)
#define CH32V203_CAN1_TXMDHR0_DATA6       (0xff << 16) /* 00ff0000: Data byte 6 */
#define CH32V203_CAN1_TXMDHR0_DATA6_MASK  (0xff << 16)
#define CH32V203_CAN1_TXMDHR0_DATA5       (0xff << 8) /* 0000ff00: Data byte 5 */
#define CH32V203_CAN1_TXMDHR0_DATA5_MASK  (0xff << 8)
#define CH32V203_CAN1_TXMDHR0_DATA4       (0xff << 0) /* 000000ff: Data byte 4 */
#define CH32V203_CAN1_TXMDHR0_DATA4_MASK  (0xff << 0)
#define CH32V203_CAN1_TXMIR1_OFFSET       0x0190
#define CH32V203_CAN1_TXMIR1              (CH32V203_CAN1_BASE + CH32V203_CAN1_TXMIR1_OFFSET) /* read-write */
#define CH32V203_CAN1_TXMIR1_STID         (0x7ff << 21) /* ffe00000: Standard identifier */
#define CH32V203_CAN1_TXMIR1_STID_MASK    (0x7ff << 21)
#define CH32V203_CAN1_TXMIR1_EXID         (0x3ffff << 3) /* 001ffff8: extended identifier */
#define CH32V203_CAN1_TXMIR1_EXID_MASK    (0x3ffff << 3)
#define CH32V203_CAN1_TXMIR1_IDE          (1 <<  2) /* 00000004: Identifier extension */
#define CH32V203_CAN1_TXMIR1_RTR          (1 <<  1) /* 00000002: Remote transmission request */
#define CH32V203_CAN1_TXMIR1_TXRQ         (1 <<  0) /* 00000001: Transmit mailbox request */
#define CH32V203_CAN1_TXMDTR1_OFFSET      0x0194
#define CH32V203_CAN1_TXMDTR1             (CH32V203_CAN1_BASE + CH32V203_CAN1_TXMDTR1_OFFSET) /* read-write */
#define CH32V203_CAN1_TXMDTR1_TIME        (0xffff << 16) /* ffff0000: Message time stamp */
#define CH32V203_CAN1_TXMDTR1_TIME_MASK   (0xffff << 16)
#define CH32V203_CAN1_TXMDTR1_TGT         (1 <<  8) /* 00000100: Transmit global time */
#define CH32V203_CAN1_TXMDTR1_DLC         (0xf << 0) /* 0000000f: Data length code */
#define CH32V203_CAN1_TXMDTR1_DLC_MASK    (0xf << 0)
#define CH32V203_CAN1_TXMDLR1_OFFSET      0x0198
#define CH32V203_CAN1_TXMDLR1             (CH32V203_CAN1_BASE + CH32V203_CAN1_TXMDLR1_OFFSET) /* read-write */
#define CH32V203_CAN1_TXMDLR1_DATA3       (0xff << 24) /* ff000000: Data byte 3 */
#define CH32V203_CAN1_TXMDLR1_DATA3_MASK  (0xff << 24)
#define CH32V203_CAN1_TXMDLR1_DATA2       (0xff << 16) /* 00ff0000: Data byte 2 */
#define CH32V203_CAN1_TXMDLR1_DATA2_MASK  (0xff << 16)
#define CH32V203_CAN1_TXMDLR1_DATA1       (0xff << 8) /* 0000ff00: Data byte 1 */
#define CH32V203_CAN1_TXMDLR1_DATA1_MASK  (0xff << 8)
#define CH32V203_CAN1_TXMDLR1_DATA0       (0xff << 0) /* 000000ff: Data byte 0 */
#define CH32V203_CAN1_TXMDLR1_DATA0_MASK  (0xff << 0)
#define CH32V203_CAN1_TXMDHR1_OFFSET      0x019c
#define CH32V203_CAN1_TXMDHR1             (CH32V203_CAN1_BASE + CH32V203_CAN1_TXMDHR1_OFFSET) /* read-write */
#define CH32V203_CAN1_TXMDHR1_DATA7       (0xff << 24) /* ff000000: Data byte 7 */
#define CH32V203_CAN1_TXMDHR1_DATA7_MASK  (0xff << 24)
#define CH32V203_CAN1_TXMDHR1_DATA6       (0xff << 16) /* 00ff0000: Data byte 6 */
#define CH32V203_CAN1_TXMDHR1_DATA6_MASK  (0xff << 16)
#define CH32V203_CAN1_TXMDHR1_DATA5       (0xff << 8) /* 0000ff00: Data byte 5 */
#define CH32V203_CAN1_TXMDHR1_DATA5_MASK  (0xff << 8)
#define CH32V203_CAN1_TXMDHR1_DATA4       (0xff << 0) /* 000000ff: Data byte 4 */
#define CH32V203_CAN1_TXMDHR1_DATA4_MASK  (0xff << 0)
#define CH32V203_CAN1_TXMIR2_OFFSET       0x01a0
#define CH32V203_CAN1_TXMIR2              (CH32V203_CAN1_BASE + CH32V203_CAN1_TXMIR2_OFFSET) /* read-write */
#define CH32V203_CAN1_TXMIR2_STID         (0x7ff << 21) /* ffe00000: Standard identifier */
#define CH32V203_CAN1_TXMIR2_STID_MASK    (0x7ff << 21)
#define CH32V203_CAN1_TXMIR2_EXID         (0x3ffff << 3) /* 001ffff8: extended identifier */
#define CH32V203_CAN1_TXMIR2_EXID_MASK    (0x3ffff << 3)
#define CH32V203_CAN1_TXMIR2_IDE          (1 <<  2) /* 00000004: Identifier extension */
#define CH32V203_CAN1_TXMIR2_RTR          (1 <<  1) /* 00000002: Remote transmission request */
#define CH32V203_CAN1_TXMIR2_TXRQ         (1 <<  0) /* 00000001: Transmit mailbox request */
#define CH32V203_CAN1_TXMDTR2_OFFSET      0x01a4
#define CH32V203_CAN1_TXMDTR2             (CH32V203_CAN1_BASE + CH32V203_CAN1_TXMDTR2_OFFSET) /* read-write */
#define CH32V203_CAN1_TXMDTR2_TIME        (0xffff << 16) /* ffff0000: Message time stamp */
#define CH32V203_CAN1_TXMDTR2_TIME_MASK   (0xffff << 16)
#define CH32V203_CAN1_TXMDTR2_TGT         (1 <<  8) /* 00000100: Transmit global time */
#define CH32V203_CAN1_TXMDTR2_DLC         (0xf << 0) /* 0000000f: Data length code */
#define CH32V203_CAN1_TXMDTR2_DLC_MASK    (0xf << 0)
#define CH32V203_CAN1_TXMDLR2_OFFSET      0x01a8
#define CH32V203_CAN1_TXMDLR2             (CH32V203_CAN1_BASE + CH32V203_CAN1_TXMDLR2_OFFSET) /* read-write */
#define CH32V203_CAN1_TXMDLR2_DATA3       (0xff << 24) /* ff000000: Data byte 3 */
#define CH32V203_CAN1_TXMDLR2_DATA3_MASK  (0xff << 24)
#define CH32V203_CAN1_TXMDLR2_DATA2       (0xff << 16) /* 00ff0000: Data byte 2 */
#define CH32V203_CAN1_TXMDLR2_DATA2_MASK  (0xff << 16)
#define CH32V203_CAN1_TXMDLR2_DATA1       (0xff << 8) /* 0000ff00: Data byte 1 */
#define CH32V203_CAN1_TXMDLR2_DATA1_MASK  (0xff << 8)
#define CH32V203_CAN1_TXMDLR2_DATA0       (0xff << 0) /* 000000ff: Data byte 0 */
#define CH32V203_CAN1_TXMDLR2_DATA0_MASK  (0xff << 0)
#define CH32V203_CAN1_TXMDHR2_OFFSET      0x01ac
#define CH32V203_CAN1_TXMDHR2             (CH32V203_CAN1_BASE + CH32V203_CAN1_TXMDHR2_OFFSET) /* read-write */
#define CH32V203_CAN1_TXMDHR2_DATA7       (0xff << 24) /* ff000000: Data byte 7 */
#define CH32V203_CAN1_TXMDHR2_DATA7_MASK  (0xff << 24)
#define CH32V203_CAN1_TXMDHR2_DATA6       (0xff << 16) /* 00ff0000: Data byte 6 */
#define CH32V203_CAN1_TXMDHR2_DATA6_MASK  (0xff << 16)
#define CH32V203_CAN1_TXMDHR2_DATA5       (0xff << 8) /* 0000ff00: Data byte 5 */
#define CH32V203_CAN1_TXMDHR2_DATA5_MASK  (0xff << 8)
#define CH32V203_CAN1_TXMDHR2_DATA4       (0xff << 0) /* 000000ff: Data byte 4 */
#define CH32V203_CAN1_TXMDHR2_DATA4_MASK  (0xff << 0)
#define CH32V203_CAN1_RXMIR0_OFFSET       0x01b0
#define CH32V203_CAN1_RXMIR0              (CH32V203_CAN1_BASE + CH32V203_CAN1_RXMIR0_OFFSET) /* read-only */
#define CH32V203_CAN1_RXMIR0_STID         (0x7ff << 21) /* ffe00000: Standard identifier */
#define CH32V203_CAN1_RXMIR0_STID_MASK    (0x7ff << 21)
#define CH32V203_CAN1_RXMIR0_EXID         (0x3ffff << 3) /* 001ffff8: extended identifier */
#define CH32V203_CAN1_RXMIR0_EXID_MASK    (0x3ffff << 3)
#define CH32V203_CAN1_RXMIR0_IDE          (1 <<  2) /* 00000004: Identifier extension */
#define CH32V203_CAN1_RXMIR0_RTR          (1 <<  1) /* 00000002: Remote transmission request */
#define CH32V203_CAN1_RXMDTR0_OFFSET      0x01b4
#define CH32V203_CAN1_RXMDTR0             (CH32V203_CAN1_BASE + CH32V203_CAN1_RXMDTR0_OFFSET) /* read-only */
#define CH32V203_CAN1_RXMDTR0_TIME        (0xffff << 16) /* ffff0000: Message time stamp */
#define CH32V203_CAN1_RXMDTR0_TIME_MASK   (0xffff << 16)
#define CH32V203_CAN1_RXMDTR0_FMI         (0xff << 8) /* 0000ff00: Filter match index */
#define CH32V203_CAN1_RXMDTR0_FMI_MASK    (0xff << 8)
#define CH32V203_CAN1_RXMDTR0_DLC         (0xf << 0) /* 0000000f: Data length code */
#define CH32V203_CAN1_RXMDTR0_DLC_MASK    (0xf << 0)
#define CH32V203_CAN1_RXMDLR0_OFFSET      0x01b8
#define CH32V203_CAN1_RXMDLR0             (CH32V203_CAN1_BASE + CH32V203_CAN1_RXMDLR0_OFFSET) /* read-only */
#define CH32V203_CAN1_RXMDLR0_DATA3       (0xff << 24) /* ff000000: Data Byte 3 */
#define CH32V203_CAN1_RXMDLR0_DATA3_MASK  (0xff << 24)
#define CH32V203_CAN1_RXMDLR0_DATA2       (0xff << 16) /* 00ff0000: Data Byte 2 */
#define CH32V203_CAN1_RXMDLR0_DATA2_MASK  (0xff << 16)
#define CH32V203_CAN1_RXMDLR0_DATA1       (0xff << 8) /* 0000ff00: Data Byte 1 */
#define CH32V203_CAN1_RXMDLR0_DATA1_MASK  (0xff << 8)
#define CH32V203_CAN1_RXMDLR0_DATA0       (0xff << 0) /* 000000ff: Data Byte 0 */
#define CH32V203_CAN1_RXMDLR0_DATA0_MASK  (0xff << 0)
#define CH32V203_CAN1_RXMDHR0_OFFSET      0x01bc
#define CH32V203_CAN1_RXMDHR0             (CH32V203_CAN1_BASE + CH32V203_CAN1_RXMDHR0_OFFSET) /* read-only */
#define CH32V203_CAN1_RXMDHR0_DATA7       (0xff << 24) /* ff000000: DATA7 */
#define CH32V203_CAN1_RXMDHR0_DATA7_MASK  (0xff << 24)
#define CH32V203_CAN1_RXMDHR0_DATA6       (0xff << 16) /* 00ff0000: DATA6 */
#define CH32V203_CAN1_RXMDHR0_DATA6_MASK  (0xff << 16)
#define CH32V203_CAN1_RXMDHR0_DATA5       (0xff << 8) /* 0000ff00: DATA5 */
#define CH32V203_CAN1_RXMDHR0_DATA5_MASK  (0xff << 8)
#define CH32V203_CAN1_RXMDHR0_DATA4       (0xff << 0) /* 000000ff: DATA4 */
#define CH32V203_CAN1_RXMDHR0_DATA4_MASK  (0xff << 0)
#define CH32V203_CAN1_RXMIR1_OFFSET       0x01c0
#define CH32V203_CAN1_RXMIR1              (CH32V203_CAN1_BASE + CH32V203_CAN1_RXMIR1_OFFSET) /* read-only */
#define CH32V203_CAN1_RXMIR1_STID         (0x7ff << 21) /* ffe00000: Standard identifier */
#define CH32V203_CAN1_RXMIR1_STID_MASK    (0x7ff << 21)
#define CH32V203_CAN1_RXMIR1_EXID         (0x3ffff << 3) /* 001ffff8: extended identifier */
#define CH32V203_CAN1_RXMIR1_EXID_MASK    (0x3ffff << 3)
#define CH32V203_CAN1_RXMIR1_IDE          (1 <<  2) /* 00000004: Identifier extension */
#define CH32V203_CAN1_RXMIR1_RTR          (1 <<  1) /* 00000002: Remote transmission request */
#define CH32V203_CAN1_RXMDTR1_OFFSET      0x01c4
#define CH32V203_CAN1_RXMDTR1             (CH32V203_CAN1_BASE + CH32V203_CAN1_RXMDTR1_OFFSET) /* read-only */
#define CH32V203_CAN1_RXMDTR1_TIME        (0xffff << 16) /* ffff0000: Message time stamp */
#define CH32V203_CAN1_RXMDTR1_TIME_MASK   (0xffff << 16)
#define CH32V203_CAN1_RXMDTR1_FMI         (0xff << 8) /* 0000ff00: Filter match index */
#define CH32V203_CAN1_RXMDTR1_FMI_MASK    (0xff << 8)
#define CH32V203_CAN1_RXMDTR1_DLC         (0xf << 0) /* 0000000f: Data length code */
#define CH32V203_CAN1_RXMDTR1_DLC_MASK    (0xf << 0)
#define CH32V203_CAN1_RXMDLR1_OFFSET      0x01c8
#define CH32V203_CAN1_RXMDLR1             (CH32V203_CAN1_BASE + CH32V203_CAN1_RXMDLR1_OFFSET) /* read-only */
#define CH32V203_CAN1_RXMDLR1_DATA3       (0xff << 24) /* ff000000: Data Byte 3 */
#define CH32V203_CAN1_RXMDLR1_DATA3_MASK  (0xff << 24)
#define CH32V203_CAN1_RXMDLR1_DATA2       (0xff << 16) /* 00ff0000: Data Byte 2 */
#define CH32V203_CAN1_RXMDLR1_DATA2_MASK  (0xff << 16)
#define CH32V203_CAN1_RXMDLR1_DATA1       (0xff << 8) /* 0000ff00: Data Byte 1 */
#define CH32V203_CAN1_RXMDLR1_DATA1_MASK  (0xff << 8)
#define CH32V203_CAN1_RXMDLR1_DATA0       (0xff << 0) /* 000000ff: Data Byte 0 */
#define CH32V203_CAN1_RXMDLR1_DATA0_MASK  (0xff << 0)
#define CH32V203_CAN1_RXMDHR1_OFFSET      0x01cc
#define CH32V203_CAN1_RXMDHR1             (CH32V203_CAN1_BASE + CH32V203_CAN1_RXMDHR1_OFFSET) /* read-only */
#define CH32V203_CAN1_RXMDHR1_DATA7       (0xff << 24) /* ff000000: DATA7 */
#define CH32V203_CAN1_RXMDHR1_DATA7_MASK  (0xff << 24)
#define CH32V203_CAN1_RXMDHR1_DATA6       (0xff << 16) /* 00ff0000: DATA6 */
#define CH32V203_CAN1_RXMDHR1_DATA6_MASK  (0xff << 16)
#define CH32V203_CAN1_RXMDHR1_DATA5       (0xff << 8) /* 0000ff00: DATA5 */
#define CH32V203_CAN1_RXMDHR1_DATA5_MASK  (0xff << 8)
#define CH32V203_CAN1_RXMDHR1_DATA4       (0xff << 0) /* 000000ff: DATA4 */
#define CH32V203_CAN1_RXMDHR1_DATA4_MASK  (0xff << 0)
#define CH32V203_CAN1_FCTLR_OFFSET        0x0200
#define CH32V203_CAN1_FCTLR               (CH32V203_CAN1_BASE + CH32V203_CAN1_FCTLR_OFFSET) /* read-write */
#define CH32V203_CAN1_FCTLR_FINIT         (1 <<  0) /* 00000001: Filter init mode */
#define CH32V203_CAN1_FMCFGR_OFFSET       0x0204
#define CH32V203_CAN1_FMCFGR              (CH32V203_CAN1_BASE + CH32V203_CAN1_FMCFGR_OFFSET) /* read-write */
#define CH32V203_CAN1_FMCFGR_FBM0         (1 <<  0) /* 00000001: Filter mode */
#define CH32V203_CAN1_FMCFGR_FBM1         (1 <<  1) /* 00000002: Filter mode */
#define CH32V203_CAN1_FMCFGR_FBM2         (1 <<  2) /* 00000004: Filter mode */
#define CH32V203_CAN1_FMCFGR_FBM3         (1 <<  3) /* 00000008: Filter mode */
#define CH32V203_CAN1_FMCFGR_FBM4         (1 <<  4) /* 00000010: Filter mode */
#define CH32V203_CAN1_FMCFGR_FBM5         (1 <<  5) /* 00000020: Filter mode */
#define CH32V203_CAN1_FMCFGR_FBM6         (1 <<  6) /* 00000040: Filter mode */
#define CH32V203_CAN1_FMCFGR_FBM7         (1 <<  7) /* 00000080: Filter mode */
#define CH32V203_CAN1_FMCFGR_FBM8         (1 <<  8) /* 00000100: Filter mode */
#define CH32V203_CAN1_FMCFGR_FBM9         (1 <<  9) /* 00000200: Filter mode */
#define CH32V203_CAN1_FMCFGR_FBM10        (1 << 10) /* 00000400: Filter mode */
#define CH32V203_CAN1_FMCFGR_FBM11        (1 << 11) /* 00000800: Filter mode */
#define CH32V203_CAN1_FMCFGR_FBM12        (1 << 12) /* 00001000: Filter mode */
#define CH32V203_CAN1_FMCFGR_FBM13        (1 << 13) /* 00002000: Filter mode */
#define CH32V203_CAN1_FSCFGR_OFFSET       0x020c
#define CH32V203_CAN1_FSCFGR              (CH32V203_CAN1_BASE + CH32V203_CAN1_FSCFGR_OFFSET) /* read-write */
#define CH32V203_CAN1_FSCFGR_FSC0         (1 <<  0) /* 00000001: Filter scale configuration */
#define CH32V203_CAN1_FSCFGR_FSC1         (1 <<  1) /* 00000002: Filter scale configuration */
