robertlipe/svdtoheaders/demo/h/ch32v20x_reg.h
#define CH32V203_CAN1_F8R1_FB3            (1 <<  3) /* 00000008: Filter bits */
#define CH32V203_CAN1_F8R1_FB4            (1 <<  4) /* 00000010: Filter bits */
#define CH32V203_CAN1_F8R1_FB5            (1 <<  5) /* 00000020: Filter bits */
#define CH32V203_CAN1_F8R1_FB6            (1 <<  6) /* 00000040: Filter bits */
#define CH32V203_CAN1_F8R1_FB7            (1 <<  7) /* 00000080: Filter bits */
#define CH32V203_CAN1_F8R1_FB8            (1 <<  8) /* 00000100: Filter bits */
#define CH32V203_CAN1_F8R1_FB9            (1 <<  9) /* 00000200: Filter bits */
#define CH32V203_CAN1_F8R1_FB10           (1 << 10) /* 00000400: Filter bits */
#define CH32V203_CAN1_F8R1_FB11           (1 << 11) /* 00000800: Filter bits */
#define CH32V203_CAN1_F8R1_FB12           (1 << 12) /* 00001000: Filter bits */
#define CH32V203_CAN1_F8R1_FB13           (1 << 13) /* 00002000: Filter bits */
#define CH32V203_CAN1_F8R1_FB14           (1 << 14) /* 00004000: Filter bits */
#define CH32V203_CAN1_F8R1_FB15           (1 << 15) /* 00008000: Filter bits */
#define CH32V203_CAN1_F8R1_FB16           (1 << 16) /* 00010000: Filter bits */
#define CH32V203_CAN1_F8R1_FB17           (1 << 17) /* 00020000: Filter bits */
#define CH32V203_CAN1_F8R1_FB18           (1 << 18) /* 00040000: Filter bits */
#define CH32V203_CAN1_F8R1_FB19           (1 << 19) /* 00080000: Filter bits */
#define CH32V203_CAN1_F8R1_FB20           (1 << 20) /* 00100000: Filter bits */
#define CH32V203_CAN1_F8R1_FB21           (1 << 21) /* 00200000: Filter bits */
#define CH32V203_CAN1_F8R1_FB22           (1 << 22) /* 00400000: Filter bits */
#define CH32V203_CAN1_F8R1_FB23           (1 << 23) /* 00800000: Filter bits */
#define CH32V203_CAN1_F8R1_FB24           (1 << 24) /* 01000000: Filter bits */
#define CH32V203_CAN1_F8R1_FB25           (1 << 25) /* 02000000: Filter bits */
#define CH32V203_CAN1_F8R1_FB26           (1 << 26) /* 04000000: Filter bits */
#define CH32V203_CAN1_F8R1_FB27           (1 << 27) /* 08000000: Filter bits */
#define CH32V203_CAN1_F8R1_FB28           (1 << 28) /* 10000000: Filter bits */
#define CH32V203_CAN1_F8R1_FB29           (1 << 29) /* 20000000: Filter bits */
#define CH32V203_CAN1_F8R1_FB30           (1 << 30) /* 40000000: Filter bits */
#define CH32V203_CAN1_F8R1_FB31           (1 << 31) /* 80000000: Filter bits */
#define CH32V203_CAN1_F8R2_OFFSET         0x0284
#define CH32V203_CAN1_F8R2                (CH32V203_CAN1_BASE + CH32V203_CAN1_F8R2_OFFSET) /* read-write */
#define CH32V203_CAN1_F8R2_FB0            (1 <<  0) /* 00000001: Filter bits */
#define CH32V203_CAN1_F8R2_FB1            (1 <<  1) /* 00000002: Filter bits */
#define CH32V203_CAN1_F8R2_FB2            (1 <<  2) /* 00000004: Filter bits */
#define CH32V203_CAN1_F8R2_FB3            (1 <<  3) /* 00000008: Filter bits */
#define CH32V203_CAN1_F8R2_FB4            (1 <<  4) /* 00000010: Filter bits */
#define CH32V203_CAN1_F8R2_FB5            (1 <<  5) /* 00000020: Filter bits */
#define CH32V203_CAN1_F8R2_FB6            (1 <<  6) /* 00000040: Filter bits */
#define CH32V203_CAN1_F8R2_FB7            (1 <<  7) /* 00000080: Filter bits */
#define CH32V203_CAN1_F8R2_FB8            (1 <<  8) /* 00000100: Filter bits */
#define CH32V203_CAN1_F8R2_FB9            (1 <<  9) /* 00000200: Filter bits */
#define CH32V203_CAN1_F8R2_FB10           (1 << 10) /* 00000400: Filter bits */
#define CH32V203_CAN1_F8R2_FB11           (1 << 11) /* 00000800: Filter bits */
#define CH32V203_CAN1_F8R2_FB12           (1 << 12) /* 00001000: Filter bits */
#define CH32V203_CAN1_F8R2_FB13           (1 << 13) /* 00002000: Filter bits */
#define CH32V203_CAN1_F8R2_FB14           (1 << 14) /* 00004000: Filter bits */
#define CH32V203_CAN1_F8R2_FB15           (1 << 15) /* 00008000: Filter bits */
#define CH32V203_CAN1_F8R2_FB16           (1 << 16) /* 00010000: Filter bits */
#define CH32V203_CAN1_F8R2_FB17           (1 << 17) /* 00020000: Filter bits */
#define CH32V203_CAN1_F8R2_FB18           (1 << 18) /* 00040000: Filter bits */
#define CH32V203_CAN1_F8R2_FB19           (1 << 19) /* 00080000: Filter bits */
#define CH32V203_CAN1_F8R2_FB20           (1 << 20) /* 00100000: Filter bits */
#define CH32V203_CAN1_F8R2_FB21           (1 << 21) /* 00200000: Filter bits */
#define CH32V203_CAN1_F8R2_FB22           (1 << 22) /* 00400000: Filter bits */
#define CH32V203_CAN1_F8R2_FB23           (1 << 23) /* 00800000: Filter bits */
#define CH32V203_CAN1_F8R2_FB24           (1 << 24) /* 01000000: Filter bits */
#define CH32V203_CAN1_F8R2_FB25           (1 << 25) /* 02000000: Filter bits */
#define CH32V203_CAN1_F8R2_FB26           (1 << 26) /* 04000000: Filter bits */
#define CH32V203_CAN1_F8R2_FB27           (1 << 27) /* 08000000: Filter bits */
#define CH32V203_CAN1_F8R2_FB28           (1 << 28) /* 10000000: Filter bits */
#define CH32V203_CAN1_F8R2_FB29           (1 << 29) /* 20000000: Filter bits */
#define CH32V203_CAN1_F8R2_FB30           (1 << 30) /* 40000000: Filter bits */
#define CH32V203_CAN1_F8R2_FB31           (1 << 31) /* 80000000: Filter bits */
#define CH32V203_CAN1_F9R1_OFFSET         0x0288
#define CH32V203_CAN1_F9R1                (CH32V203_CAN1_BASE + CH32V203_CAN1_F9R1_OFFSET) /* read-write */
#define CH32V203_CAN1_F9R1_FB0            (1 <<  0) /* 00000001: Filter bits */
#define CH32V203_CAN1_F9R1_FB1            (1 <<  1) /* 00000002: Filter bits */
#define CH32V203_CAN1_F9R1_FB2            (1 <<  2) /* 00000004: Filter bits */
#define CH32V203_CAN1_F9R1_FB3            (1 <<  3) /* 00000008: Filter bits */
#define CH32V203_CAN1_F9R1_FB4            (1 <<  4) /* 00000010: Filter bits */
#define CH32V203_CAN1_F9R1_FB5            (1 <<  5) /* 00000020: Filter bits */
#define CH32V203_CAN1_F9R1_FB6            (1 <<  6) /* 00000040: Filter bits */
#define CH32V203_CAN1_F9R1_FB7            (1 <<  7) /* 00000080: Filter bits */
#define CH32V203_CAN1_F9R1_FB8            (1 <<  8) /* 00000100: Filter bits */
#define CH32V203_CAN1_F9R1_FB9            (1 <<  9) /* 00000200: Filter bits */
#define CH32V203_CAN1_F9R1_FB10           (1 << 10) /* 00000400: Filter bits */
#define CH32V203_CAN1_F9R1_FB11           (1 << 11) /* 00000800: Filter bits */
#define CH32V203_CAN1_F9R1_FB12           (1 << 12) /* 00001000: Filter bits */
#define CH32V203_CAN1_F9R1_FB13           (1 << 13) /* 00002000: Filter bits */
#define CH32V203_CAN1_F9R1_FB14           (1 << 14) /* 00004000: Filter bits */
#define CH32V203_CAN1_F9R1_FB15           (1 << 15) /* 00008000: Filter bits */
#define CH32V203_CAN1_F9R1_FB16           (1 << 16) /* 00010000: Filter bits */
#define CH32V203_CAN1_F9R1_FB17           (1 << 17) /* 00020000: Filter bits */
#define CH32V203_CAN1_F9R1_FB18           (1 << 18) /* 00040000: Filter bits */
#define CH32V203_CAN1_F9R1_FB19           (1 << 19) /* 00080000: Filter bits */
#define CH32V203_CAN1_F9R1_FB20           (1 << 20) /* 00100000: Filter bits */
#define CH32V203_CAN1_F9R1_FB21           (1 << 21) /* 00200000: Filter bits */
#define CH32V203_CAN1_F9R1_FB22           (1 << 22) /* 00400000: Filter bits */
#define CH32V203_CAN1_F9R1_FB23           (1 << 23) /* 00800000: Filter bits */
#define CH32V203_CAN1_F9R1_FB24           (1 << 24) /* 01000000: Filter bits */
#define CH32V203_CAN1_F9R1_FB25           (1 << 25) /* 02000000: Filter bits */
#define CH32V203_CAN1_F9R1_FB26           (1 << 26) /* 04000000: Filter bits */
#define CH32V203_CAN1_F9R1_FB27           (1 << 27) /* 08000000: Filter bits */
#define CH32V203_CAN1_F9R1_FB28           (1 << 28) /* 10000000: Filter bits */
#define CH32V203_CAN1_F9R1_FB29           (1 << 29) /* 20000000: Filter bits */
#define CH32V203_CAN1_F9R1_FB30           (1 << 30) /* 40000000: Filter bits */
#define CH32V203_CAN1_F9R1_FB31           (1 << 31) /* 80000000: Filter bits */
#define CH32V203_CAN1_F9R2_OFFSET         0x028c
#define CH32V203_CAN1_F9R2                (CH32V203_CAN1_BASE + CH32V203_CAN1_F9R2_OFFSET) /* read-write */
#define CH32V203_CAN1_F9R2_FB0            (1 <<  0) /* 00000001: Filter bits */
#define CH32V203_CAN1_F9R2_FB1            (1 <<  1) /* 00000002: Filter bits */
#define CH32V203_CAN1_F9R2_FB2            (1 <<  2) /* 00000004: Filter bits */
#define CH32V203_CAN1_F9R2_FB3            (1 <<  3) /* 00000008: Filter bits */
#define CH32V203_CAN1_F9R2_FB4            (1 <<  4) /* 00000010: Filter bits */
#define CH32V203_CAN1_F9R2_FB5            (1 <<  5) /* 00000020: Filter bits */
#define CH32V203_CAN1_F9R2_FB6            (1 <<  6) /* 00000040: Filter bits */
#define CH32V203_CAN1_F9R2_FB7            (1 <<  7) /* 00000080: Filter bits */
#define CH32V203_CAN1_F9R2_FB8            (1 <<  8) /* 00000100: Filter bits */
#define CH32V203_CAN1_F9R2_FB9            (1 <<  9) /* 00000200: Filter bits */
#define CH32V203_CAN1_F9R2_FB10           (1 << 10) /* 00000400: Filter bits */
#define CH32V203_CAN1_F9R2_FB11           (1 << 11) /* 00000800: Filter bits */
#define CH32V203_CAN1_F9R2_FB12           (1 << 12) /* 00001000: Filter bits */
#define CH32V203_CAN1_F9R2_FB13           (1 << 13) /* 00002000: Filter bits */
#define CH32V203_CAN1_F9R2_FB14           (1 << 14) /* 00004000: Filter bits */
#define CH32V203_CAN1_F9R2_FB15           (1 << 15) /* 00008000: Filter bits */
#define CH32V203_CAN1_F9R2_FB16           (1 << 16) /* 00010000: Filter bits */
#define CH32V203_CAN1_F9R2_FB17           (1 << 17) /* 00020000: Filter bits */
#define CH32V203_CAN1_F9R2_FB18           (1 << 18) /* 00040000: Filter bits */
#define CH32V203_CAN1_F9R2_FB19           (1 << 19) /* 00080000: Filter bits */
#define CH32V203_CAN1_F9R2_FB20           (1 << 20) /* 00100000: Filter bits */
#define CH32V203_CAN1_F9R2_FB21           (1 << 21) /* 00200000: Filter bits */
#define CH32V203_CAN1_F9R2_FB22           (1 << 22) /* 00400000: Filter bits */
#define CH32V203_CAN1_F9R2_FB23           (1 << 23) /* 00800000: Filter bits */
#define CH32V203_CAN1_F9R2_FB24           (1 << 24) /* 01000000: Filter bits */
#define CH32V203_CAN1_F9R2_FB25           (1 << 25) /* 02000000: Filter bits */
#define CH32V203_CAN1_F9R2_FB26           (1 << 26) /* 04000000: Filter bits */
#define CH32V203_CAN1_F9R2_FB27           (1 << 27) /* 08000000: Filter bits */
#define CH32V203_CAN1_F9R2_FB28           (1 << 28) /* 10000000: Filter bits */
#define CH32V203_CAN1_F9R2_FB29           (1 << 29) /* 20000000: Filter bits */
#define CH32V203_CAN1_F9R2_FB30           (1 << 30) /* 40000000: Filter bits */
#define CH32V203_CAN1_F9R2_FB31           (1 << 31) /* 80000000: Filter bits */
#define CH32V203_CAN1_F10R1_OFFSET        0x0290
#define CH32V203_CAN1_F10R1               (CH32V203_CAN1_BASE + CH32V203_CAN1_F10R1_OFFSET) /* read-write */
#define CH32V203_CAN1_F10R1_FB0           (1 <<  0) /* 00000001: Filter bits */
#define CH32V203_CAN1_F10R1_FB1           (1 <<  1) /* 00000002: Filter bits */
#define CH32V203_CAN1_F10R1_FB2           (1 <<  2) /* 00000004: Filter bits */
#define CH32V203_CAN1_F10R1_FB3           (1 <<  3) /* 00000008: Filter bits */
#define CH32V203_CAN1_F10R1_FB4           (1 <<  4) /* 00000010: Filter bits */
#define CH32V203_CAN1_F10R1_FB5           (1 <<  5) /* 00000020: Filter bits */
#define CH32V203_CAN1_F10R1_FB6           (1 <<  6) /* 00000040: Filter bits */
#define CH32V203_CAN1_F10R1_FB7           (1 <<  7) /* 00000080: Filter bits */
#define CH32V203_CAN1_F10R1_FB8           (1 <<  8) /* 00000100: Filter bits */
#define CH32V203_CAN1_F10R1_FB9           (1 <<  9) /* 00000200: Filter bits */
#define CH32V203_CAN1_F10R1_FB10          (1 << 10) /* 00000400: Filter bits */
#define CH32V203_CAN1_F10R1_FB11          (1 << 11) /* 00000800: Filter bits */
#define CH32V203_CAN1_F10R1_FB12          (1 << 12) /* 00001000: Filter bits */
#define CH32V203_CAN1_F10R1_FB13          (1 << 13) /* 00002000: Filter bits */
#define CH32V203_CAN1_F10R1_FB14          (1 << 14) /* 00004000: Filter bits */
#define CH32V203_CAN1_F10R1_FB15          (1 << 15) /* 00008000: Filter bits */
#define CH32V203_CAN1_F10R1_FB16          (1 << 16) /* 00010000: Filter bits */
#define CH32V203_CAN1_F10R1_FB17          (1 << 17) /* 00020000: Filter bits */
#define CH32V203_CAN1_F10R1_FB18          (1 << 18) /* 00040000: Filter bits */
#define CH32V203_CAN1_F10R1_FB19          (1 << 19) /* 00080000: Filter bits */
#define CH32V203_CAN1_F10R1_FB20          (1 << 20) /* 00100000: Filter bits */
#define CH32V203_CAN1_F10R1_FB21          (1 << 21) /* 00200000: Filter bits */
#define CH32V203_CAN1_F10R1_FB22          (1 << 22) /* 00400000: Filter bits */
#define CH32V203_CAN1_F10R1_FB23          (1 << 23) /* 00800000: Filter bits */
#define CH32V203_CAN1_F10R1_FB24          (1 << 24) /* 01000000: Filter bits */
#define CH32V203_CAN1_F10R1_FB25          (1 << 25) /* 02000000: Filter bits */
#define CH32V203_CAN1_F10R1_FB26          (1 << 26) /* 04000000: Filter bits */
#define CH32V203_CAN1_F10R1_FB27          (1 << 27) /* 08000000: Filter bits */
#define CH32V203_CAN1_F10R1_FB28          (1 << 28) /* 10000000: Filter bits */
#define CH32V203_CAN1_F10R1_FB29          (1 << 29) /* 20000000: Filter bits */
#define CH32V203_CAN1_F10R1_FB30          (1 << 30) /* 40000000: Filter bits */
#define CH32V203_CAN1_F10R1_FB31          (1 << 31) /* 80000000: Filter bits */
#define CH32V203_CAN1_F10R2_OFFSET        0x0294
#define CH32V203_CAN1_F10R2               (CH32V203_CAN1_BASE + CH32V203_CAN1_F10R2_OFFSET) /* read-write */
#define CH32V203_CAN1_F10R2_FB0           (1 <<  0) /* 00000001: Filter bits */
#define CH32V203_CAN1_F10R2_FB1           (1 <<  1) /* 00000002: Filter bits */
#define CH32V203_CAN1_F10R2_FB2           (1 <<  2) /* 00000004: Filter bits */
#define CH32V203_CAN1_F10R2_FB3           (1 <<  3) /* 00000008: Filter bits */
#define CH32V203_CAN1_F10R2_FB4           (1 <<  4) /* 00000010: Filter bits */
#define CH32V203_CAN1_F10R2_FB5           (1 <<  5) /* 00000020: Filter bits */
#define CH32V203_CAN1_F10R2_FB6           (1 <<  6) /* 00000040: Filter bits */
#define CH32V203_CAN1_F10R2_FB7           (1 <<  7) /* 00000080: Filter bits */
#define CH32V203_CAN1_F10R2_FB8           (1 <<  8) /* 00000100: Filter bits */
#define CH32V203_CAN1_F10R2_FB9           (1 <<  9) /* 00000200: Filter bits */
#define CH32V203_CAN1_F10R2_FB10          (1 << 10) /* 00000400: Filter bits */
#define CH32V203_CAN1_F10R2_FB11          (1 << 11) /* 00000800: Filter bits */
#define CH32V203_CAN1_F10R2_FB12          (1 << 12) /* 00001000: Filter bits */
#define CH32V203_CAN1_F10R2_FB13          (1 << 13) /* 00002000: Filter bits */
#define CH32V203_CAN1_F10R2_FB14          (1 << 14) /* 00004000: Filter bits */
#define CH32V203_CAN1_F10R2_FB15          (1 << 15) /* 00008000: Filter bits */
#define CH32V203_CAN1_F10R2_FB16          (1 << 16) /* 00010000: Filter bits */
#define CH32V203_CAN1_F10R2_FB17          (1 << 17) /* 00020000: Filter bits */
#define CH32V203_CAN1_F10R2_FB18          (1 << 18) /* 00040000: Filter bits */
#define CH32V203_CAN1_F10R2_FB19          (1 << 19) /* 00080000: Filter bits */
#define CH32V203_CAN1_F10R2_FB20          (1 << 20) /* 00100000: Filter bits */
#define CH32V203_CAN1_F10R2_FB21          (1 << 21) /* 00200000: Filter bits */
#define CH32V203_CAN1_F10R2_FB22          (1 << 22) /* 00400000: Filter bits */
#define CH32V203_CAN1_F10R2_FB23          (1 << 23) /* 00800000: Filter bits */
#define CH32V203_CAN1_F10R2_FB24          (1 << 24) /* 01000000: Filter bits */
#define CH32V203_CAN1_F10R2_FB25          (1 << 25) /* 02000000: Filter bits */
#define CH32V203_CAN1_F10R2_FB26          (1 << 26) /* 04000000: Filter bits */
#define CH32V203_CAN1_F10R2_FB27          (1 << 27) /* 08000000: Filter bits */
#define CH32V203_CAN1_F10R2_FB28          (1 << 28) /* 10000000: Filter bits */
#define CH32V203_CAN1_F10R2_FB29          (1 << 29) /* 20000000: Filter bits */
#define CH32V203_CAN1_F10R2_FB30          (1 << 30) /* 40000000: Filter bits */
#define CH32V203_CAN1_F10R2_FB31          (1 << 31) /* 80000000: Filter bits */
#define CH32V203_CAN1_F11R1_OFFSET        0x0298
#define CH32V203_CAN1_F11R1               (CH32V203_CAN1_BASE + CH32V203_CAN1_F11R1_OFFSET) /* read-write */
#define CH32V203_CAN1_F11R1_FB0           (1 <<  0) /* 00000001: Filter bits */
#define CH32V203_CAN1_F11R1_FB1           (1 <<  1) /* 00000002: Filter bits */
#define CH32V203_CAN1_F11R1_FB2           (1 <<  2) /* 00000004: Filter bits */
#define CH32V203_CAN1_F11R1_FB3           (1 <<  3) /* 00000008: Filter bits */
#define CH32V203_CAN1_F11R1_FB4           (1 <<  4) /* 00000010: Filter bits */
#define CH32V203_CAN1_F11R1_FB5           (1 <<  5) /* 00000020: Filter bits */
#define CH32V203_CAN1_F11R1_FB6           (1 <<  6) /* 00000040: Filter bits */
#define CH32V203_CAN1_F11R1_FB7           (1 <<  7) /* 00000080: Filter bits */
#define CH32V203_CAN1_F11R1_FB8           (1 <<  8) /* 00000100: Filter bits */
#define CH32V203_CAN1_F11R1_FB9           (1 <<  9) /* 00000200: Filter bits */
#define CH32V203_CAN1_F11R1_FB10          (1 << 10) /* 00000400: Filter bits */
#define CH32V203_CAN1_F11R1_FB11          (1 << 11) /* 00000800: Filter bits */
#define CH32V203_CAN1_F11R1_FB12          (1 << 12) /* 00001000: Filter bits */
#define CH32V203_CAN1_F11R1_FB13          (1 << 13) /* 00002000: Filter bits */
#define CH32V203_CAN1_F11R1_FB14          (1 << 14) /* 00004000: Filter bits */
#define CH32V203_CAN1_F11R1_FB15          (1 << 15) /* 00008000: Filter bits */
#define CH32V203_CAN1_F11R1_FB16          (1 << 16) /* 00010000: Filter bits */
#define CH32V203_CAN1_F11R1_FB17          (1 << 17) /* 00020000: Filter bits */
#define CH32V203_CAN1_F11R1_FB18          (1 << 18) /* 00040000: Filter bits */
#define CH32V203_CAN1_F11R1_FB19          (1 << 19) /* 00080000: Filter bits */
#define CH32V203_CAN1_F11R1_FB20          (1 << 20) /* 00100000: Filter bits */
#define CH32V203_CAN1_F11R1_FB21          (1 << 21) /* 00200000: Filter bits */
#define CH32V203_CAN1_F11R1_FB22          (1 << 22) /* 00400000: Filter bits */
#define CH32V203_CAN1_F11R1_FB23          (1 << 23) /* 00800000: Filter bits */
#define CH32V203_CAN1_F11R1_FB24          (1 << 24) /* 01000000: Filter bits */
#define CH32V203_CAN1_F11R1_FB25          (1 << 25) /* 02000000: Filter bits */
#define CH32V203_CAN1_F11R1_FB26          (1 << 26) /* 04000000: Filter bits */
#define CH32V203_CAN1_F11R1_FB27          (1 << 27) /* 08000000: Filter bits */
#define CH32V203_CAN1_F11R1_FB28          (1 << 28) /* 10000000: Filter bits */
#define CH32V203_CAN1_F11R1_FB29          (1 << 29) /* 20000000: Filter bits */
#define CH32V203_CAN1_F11R1_FB30          (1 << 30) /* 40000000: Filter bits */
#define CH32V203_CAN1_F11R1_FB31          (1 << 31) /* 80000000: Filter bits */
#define CH32V203_CAN1_F11R2_OFFSET        0x029c
#define CH32V203_CAN1_F11R2               (CH32V203_CAN1_BASE + CH32V203_CAN1_F11R2_OFFSET) /* read-write */
#define CH32V203_CAN1_F11R2_FB0           (1 <<  0) /* 00000001: Filter bits */
#define CH32V203_CAN1_F11R2_FB1           (1 <<  1) /* 00000002: Filter bits */
#define CH32V203_CAN1_F11R2_FB2           (1 <<  2) /* 00000004: Filter bits */
#define CH32V203_CAN1_F11R2_FB3           (1 <<  3) /* 00000008: Filter bits */
#define CH32V203_CAN1_F11R2_FB4           (1 <<  4) /* 00000010: Filter bits */
#define CH32V203_CAN1_F11R2_FB5           (1 <<  5) /* 00000020: Filter bits */
#define CH32V203_CAN1_F11R2_FB6           (1 <<  6) /* 00000040: Filter bits */
#define CH32V203_CAN1_F11R2_FB7           (1 <<  7) /* 00000080: Filter bits */
#define CH32V203_CAN1_F11R2_FB8           (1 <<  8) /* 00000100: Filter bits */
#define CH32V203_CAN1_F11R2_FB9           (1 <<  9) /* 00000200: Filter bits */
#define CH32V203_CAN1_F11R2_FB10          (1 << 10) /* 00000400: Filter bits */
#define CH32V203_CAN1_F11R2_FB11          (1 << 11) /* 00000800: Filter bits */
#define CH32V203_CAN1_F11R2_FB12          (1 << 12) /* 00001000: Filter bits */
#define CH32V203_CAN1_F11R2_FB13          (1 << 13) /* 00002000: Filter bits */
#define CH32V203_CAN1_F11R2_FB14          (1 << 14) /* 00004000: Filter bits */
#define CH32V203_CAN1_F11R2_FB15          (1 << 15) /* 00008000: Filter bits */
#define CH32V203_CAN1_F11R2_FB16          (1 << 16) /* 00010000: Filter bits */
#define CH32V203_CAN1_F11R2_FB17          (1 << 17) /* 00020000: Filter bits */
#define CH32V203_CAN1_F11R2_FB18          (1 << 18) /* 00040000: Filter bits */
#define CH32V203_CAN1_F11R2_FB19          (1 << 19) /* 00080000: Filter bits */
#define CH32V203_CAN1_F11R2_FB20          (1 << 20) /* 00100000: Filter bits */
#define CH32V203_CAN1_F11R2_FB21          (1 << 21) /* 00200000: Filter bits */
#define CH32V203_CAN1_F11R2_FB22          (1 << 22) /* 00400000: Filter bits */
#define CH32V203_CAN1_F11R2_FB23          (1 << 23) /* 00800000: Filter bits */
#define CH32V203_CAN1_F11R2_FB24          (1 << 24) /* 01000000: Filter bits */
#define CH32V203_CAN1_F11R2_FB25          (1 << 25) /* 02000000: Filter bits */
#define CH32V203_CAN1_F11R2_FB26          (1 << 26) /* 04000000: Filter bits */
#define CH32V203_CAN1_F11R2_FB27          (1 << 27) /* 08000000: Filter bits */
#define CH32V203_CAN1_F11R2_FB28          (1 << 28) /* 10000000: Filter bits */
#define CH32V203_CAN1_F11R2_FB29          (1 << 29) /* 20000000: Filter bits */
#define CH32V203_CAN1_F11R2_FB30          (1 << 30) /* 40000000: Filter bits */
#define CH32V203_CAN1_F11R2_FB31          (1 << 31) /* 80000000: Filter bits */
#define CH32V203_CAN1_F12R1_OFFSET        0x02a0
#define CH32V203_CAN1_F12R1               (CH32V203_CAN1_BASE + CH32V203_CAN1_F12R1_OFFSET) /* read-write */
#define CH32V203_CAN1_F12R1_FB0           (1 <<  0) /* 00000001: Filter bits */
#define CH32V203_CAN1_F12R1_FB1           (1 <<  1) /* 00000002: Filter bits */
#define CH32V203_CAN1_F12R1_FB2           (1 <<  2) /* 00000004: Filter bits */
#define CH32V203_CAN1_F12R1_FB3           (1 <<  3) /* 00000008: Filter bits */
#define CH32V203_CAN1_F12R1_FB4           (1 <<  4) /* 00000010: Filter bits */
#define CH32V203_CAN1_F12R1_FB5           (1 <<  5) /* 00000020: Filter bits */
#define CH32V203_CAN1_F12R1_FB6           (1 <<  6) /* 00000040: Filter bits */
#define CH32V203_CAN1_F12R1_FB7           (1 <<  7) /* 00000080: Filter bits */
#define CH32V203_CAN1_F12R1_FB8           (1 <<  8) /* 00000100: Filter bits */
#define CH32V203_CAN1_F12R1_FB9           (1 <<  9) /* 00000200: Filter bits */
#define CH32V203_CAN1_F12R1_FB10          (1 << 10) /* 00000400: Filter bits */
#define CH32V203_CAN1_F12R1_FB11          (1 << 11) /* 00000800: Filter bits */
#define CH32V203_CAN1_F12R1_FB12          (1 << 12) /* 00001000: Filter bits */
#define CH32V203_CAN1_F12R1_FB13          (1 << 13) /* 00002000: Filter bits */
#define CH32V203_CAN1_F12R1_FB14          (1 << 14) /* 00004000: Filter bits */
#define CH32V203_CAN1_F12R1_FB15          (1 << 15) /* 00008000: Filter bits */
#define CH32V203_CAN1_F12R1_FB16          (1 << 16) /* 00010000: Filter bits */
#define CH32V203_CAN1_F12R1_FB17          (1 << 17) /* 00020000: Filter bits */
#define CH32V203_CAN1_F12R1_FB18          (1 << 18) /* 00040000: Filter bits */
#define CH32V203_CAN1_F12R1_FB19          (1 << 19) /* 00080000: Filter bits */
#define CH32V203_CAN1_F12R1_FB20          (1 << 20) /* 00100000: Filter bits */
#define CH32V203_CAN1_F12R1_FB21          (1 << 21) /* 00200000: Filter bits */
#define CH32V203_CAN1_F12R1_FB22          (1 << 22) /* 00400000: Filter bits */
#define CH32V203_CAN1_F12R1_FB23          (1 << 23) /* 00800000: Filter bits */
#define CH32V203_CAN1_F12R1_FB24          (1 << 24) /* 01000000: Filter bits */
#define CH32V203_CAN1_F12R1_FB25          (1 << 25) /* 02000000: Filter bits */
#define CH32V203_CAN1_F12R1_FB26          (1 << 26) /* 04000000: Filter bits */
#define CH32V203_CAN1_F12R1_FB27          (1 << 27) /* 08000000: Filter bits */
#define CH32V203_CAN1_F12R1_FB28          (1 << 28) /* 10000000: Filter bits */
#define CH32V203_CAN1_F12R1_FB29          (1 << 29) /* 20000000: Filter bits */
#define CH32V203_CAN1_F12R1_FB30          (1 << 30) /* 40000000: Filter bits */
