robertlipe/svdtoheaders/demo/h/ch32v20x_reg.h
/* ETHERNET_MAC - Ethernet: media access control */
#define CH32V203_ETHERNET_MAC_BASE        0x40028000
#define CH32V203_ETHERNET_MAC_MACCR_OFFSET 0x0000
#define CH32V203_ETHERNET_MAC_MACCR       (CH32V203_ETHERNET_MAC_BASE + CH32V203_ETHERNET_MAC_MACCR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_MAC_MACCR_TCES  (1 <<  0) /* 00000001: Send clock selection bit */
#define CH32V203_ETHERNET_MAC_MACCR_TCF   (1 <<  1) /* 00000002: Send clock reversal */
#define CH32V203_ETHERNET_MAC_MACCR_RE    (1 <<  2) /* 00000004: Receiver enable */
#define CH32V203_ETHERNET_MAC_MACCR_TE    (1 <<  3) /* 00000008: Transmitter enable */
#define CH32V203_ETHERNET_MAC_MACCR_DC    (1 <<  4) /* 00000010: Deferral check */
#define CH32V203_ETHERNET_MAC_MACCR_BL    (0x3 << 5) /* 00000060: Back-off limit */
#define CH32V203_ETHERNET_MAC_MACCR_BL_MASK (0x3 << 5)
#define CH32V203_ETHERNET_MAC_MACCR_APCS  (1 <<  7) /* 00000080: Automatic pad/CRC stripping */
#define CH32V203_ETHERNET_MAC_MACCR_RD    (1 <<  9) /* 00000200: Retry disable */
#define CH32V203_ETHERNET_MAC_MACCR_IPCO  (1 << 10) /* 00000400: IPv4 checksum offload */
#define CH32V203_ETHERNET_MAC_MACCR_DM    (1 << 11) /* 00000800: Duplex mode */
#define CH32V203_ETHERNET_MAC_MACCR_LM    (1 << 12) /* 00001000: Loopback mode */
#define CH32V203_ETHERNET_MAC_MACCR_ROD   (1 << 13) /* 00002000: Receive own disable */
#define CH32V203_ETHERNET_MAC_MACCR_FES   (1 << 14) /* 00004000: Fast Ethernet speed */
#define CH32V203_ETHERNET_MAC_MACCR_CSD   (1 << 16) /* 00010000: Carrier sense disable */
#define CH32V203_ETHERNET_MAC_MACCR_IFG   (0x7 << 17) /* 000e0000: Interframe gap */
#define CH32V203_ETHERNET_MAC_MACCR_IFG_MASK (0x7 << 17)
#define CH32V203_ETHERNET_MAC_MACCR_IRE   (1 << 20) /* 00100000: 10MPHY 50Ω set */
#define CH32V203_ETHERNET_MAC_MACCR_PDI   (1 << 21) /* 00200000: 10MPHY TX DRIVER bisa current */
#define CH32V203_ETHERNET_MAC_MACCR_JD    (1 << 22) /* 00400000: Jabber disable */
#define CH32V203_ETHERNET_MAC_MACCR_WD    (1 << 23) /* 00800000: Watchdog disable */
#define CH32V203_ETHERNET_MAC_MACCR_TCD   (0x7 << 29) /* e0000000: SEND clock delay */
#define CH32V203_ETHERNET_MAC_MACCR_TCD_MASK (0x7 << 29)
#define CH32V203_ETHERNET_MAC_MACFFR_OFFSET 0x0004
#define CH32V203_ETHERNET_MAC_MACFFR      (CH32V203_ETHERNET_MAC_BASE + CH32V203_ETHERNET_MAC_MACFFR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_MAC_MACFFR_PM   (1 <<  0) /* 00000001: Promiscuous mode */
#define CH32V203_ETHERNET_MAC_MACFFR_HU   (1 <<  1) /* 00000002: Hash unicast */
#define CH32V203_ETHERNET_MAC_MACFFR_HM   (1 <<  2) /* 00000004: Hash multicast */
#define CH32V203_ETHERNET_MAC_MACFFR_DAIF (1 <<  3) /* 00000008: Destination address inverse filtering */
#define CH32V203_ETHERNET_MAC_MACFFR_PAM  (1 <<  4) /* 00000010: Pass all multicast */
#define CH32V203_ETHERNET_MAC_MACFFR_BFD  (1 <<  5) /* 00000020: Broadcast frames disable */
#define CH32V203_ETHERNET_MAC_MACFFR_PCF  (0x3 << 6) /* 000000c0: Pass control frames */
#define CH32V203_ETHERNET_MAC_MACFFR_PCF_MASK (0x3 << 6)
#define CH32V203_ETHERNET_MAC_MACFFR_SAIF (1 <<  8) /* 00000100: Source address inverse filtering */
#define CH32V203_ETHERNET_MAC_MACFFR_SAF  (1 <<  9) /* 00000200: Source address filter */
#define CH32V203_ETHERNET_MAC_MACFFR_HPF  (1 << 10) /* 00000400: Hash or perfect filter */
#define CH32V203_ETHERNET_MAC_MACFFR_RA   (1 << 31) /* 80000000: Receive all */
#define CH32V203_ETHERNET_MAC_MACHTHR_OFFSET 0x0008
#define CH32V203_ETHERNET_MAC_MACHTHR     (CH32V203_ETHERNET_MAC_BASE + CH32V203_ETHERNET_MAC_MACHTHR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_MAC_MACHTHR_HTH (0xffffffff << 0) /* ffffffff: Hash table high */
#define CH32V203_ETHERNET_MAC_MACHTHR_HTH_MASK (0xffffffff << 0)
#define CH32V203_ETHERNET_MAC_MACHTLR_OFFSET 0x000c
#define CH32V203_ETHERNET_MAC_MACHTLR     (CH32V203_ETHERNET_MAC_BASE + CH32V203_ETHERNET_MAC_MACHTLR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_MAC_MACHTLR_HTL (0xffffffff << 0) /* ffffffff: Hash table low */
#define CH32V203_ETHERNET_MAC_MACHTLR_HTL_MASK (0xffffffff << 0)
#define CH32V203_ETHERNET_MAC_MACMIIAR_OFFSET 0x0010
#define CH32V203_ETHERNET_MAC_MACMIIAR    (CH32V203_ETHERNET_MAC_BASE + CH32V203_ETHERNET_MAC_MACMIIAR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_MAC_MACMIIAR_MB (1 <<  0) /* 00000001: MII busy */
#define CH32V203_ETHERNET_MAC_MACMIIAR_MW (1 <<  1) /* 00000002: MII write */
#define CH32V203_ETHERNET_MAC_MACMIIAR_CR (0x7 << 2) /* 0000001c: Clock range */
#define CH32V203_ETHERNET_MAC_MACMIIAR_CR_MASK (0x7 << 2)
#define CH32V203_ETHERNET_MAC_MACMIIAR_MR (0x1f << 6) /* 000007c0: MII register */
#define CH32V203_ETHERNET_MAC_MACMIIAR_MR_MASK (0x1f << 6)
#define CH32V203_ETHERNET_MAC_MACMIIAR_PA (0x1f << 11) /* 0000f800: PHY address */
#define CH32V203_ETHERNET_MAC_MACMIIAR_PA_MASK (0x1f << 11)
#define CH32V203_ETHERNET_MAC_MACMIIDR_OFFSET 0x0014
#define CH32V203_ETHERNET_MAC_MACMIIDR    (CH32V203_ETHERNET_MAC_BASE + CH32V203_ETHERNET_MAC_MACMIIDR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_MAC_MACMIIDR_MD (0xffff << 0) /* 0000ffff: MII data */
#define CH32V203_ETHERNET_MAC_MACMIIDR_MD_MASK (0xffff << 0)
#define CH32V203_ETHERNET_MAC_MACFCR_OFFSET 0x0018
#define CH32V203_ETHERNET_MAC_MACFCR      (CH32V203_ETHERNET_MAC_BASE + CH32V203_ETHERNET_MAC_MACFCR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_MAC_MACFCR_FCB_BPA (1 <<  0) /* 00000001: Flow control busy/back pressure activate */
#define CH32V203_ETHERNET_MAC_MACFCR_TFCE (1 <<  1) /* 00000002: Transmit flow control enable */
#define CH32V203_ETHERNET_MAC_MACFCR_RFCE (1 <<  2) /* 00000004: Receive flow control enable */
#define CH32V203_ETHERNET_MAC_MACFCR_UPFD (1 <<  3) /* 00000008: Unicast pause frame detect */
#define CH32V203_ETHERNET_MAC_MACFCR_PLT  (0x3 << 4) /* 00000030: Pause low threshold */
#define CH32V203_ETHERNET_MAC_MACFCR_PLT_MASK (0x3 << 4)
#define CH32V203_ETHERNET_MAC_MACFCR_ZQPD (1 <<  7) /* 00000080: Zero-quanta pause disable */
#define CH32V203_ETHERNET_MAC_MACFCR_PT   (0xffff << 16) /* ffff0000: Pass control frames */
#define CH32V203_ETHERNET_MAC_MACFCR_PT_MASK (0xffff << 16)
#define CH32V203_ETHERNET_MAC_MACVLANTR_OFFSET 0x001c
#define CH32V203_ETHERNET_MAC_MACVLANTR   (CH32V203_ETHERNET_MAC_BASE + CH32V203_ETHERNET_MAC_MACVLANTR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_MAC_MACVLANTR_VLANTI (0xffff << 0) /* 0000ffff: VLAN tag identifier (for receive frames) */
#define CH32V203_ETHERNET_MAC_MACVLANTR_VLANTI_MASK (0xffff << 0)
#define CH32V203_ETHERNET_MAC_MACVLANTR_VLANTC (1 << 16) /* 00010000: 12-bit VLAN tag comparison */
#define CH32V203_ETHERNET_MAC_MACRWUFFR_OFFSET 0x0028
#define CH32V203_ETHERNET_MAC_MACRWUFFR   (CH32V203_ETHERNET_MAC_BASE + CH32V203_ETHERNET_MAC_MACRWUFFR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_MAC_MACPMTCSR_OFFSET 0x002c
#define CH32V203_ETHERNET_MAC_MACPMTCSR   (CH32V203_ETHERNET_MAC_BASE + CH32V203_ETHERNET_MAC_MACPMTCSR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_MAC_MACPMTCSR_PD (1 <<  0) /* 00000001: Power down */
#define CH32V203_ETHERNET_MAC_MACPMTCSR_MPE (1 <<  1) /* 00000002: Magic Packet enable */
#define CH32V203_ETHERNET_MAC_MACPMTCSR_WFE (1 <<  2) /* 00000004: Wakeup frame enable */
#define CH32V203_ETHERNET_MAC_MACPMTCSR_MPR (1 <<  5) /* 00000020: Magic packet received */
#define CH32V203_ETHERNET_MAC_MACPMTCSR_WFR (1 <<  6) /* 00000040: Wakeup frame received */
#define CH32V203_ETHERNET_MAC_MACPMTCSR_GU (1 <<  9) /* 00000200: Global unicast */
#define CH32V203_ETHERNET_MAC_MACPMTCSR_WFFRPR (1 << 31) /* 80000000: Wakeup frame filter register pointer reset */
#define CH32V203_ETHERNET_MAC_MACSR_OFFSET 0x0038
#define CH32V203_ETHERNET_MAC_MACSR       (CH32V203_ETHERNET_MAC_BASE + CH32V203_ETHERNET_MAC_MACSR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_MAC_MACSR_PMTS  (1 <<  3) /* 00000008: PMT status */
#define CH32V203_ETHERNET_MAC_MACSR_MMCS  (1 <<  4) /* 00000010: MMC status */
#define CH32V203_ETHERNET_MAC_MACSR_MMCRS (1 <<  5) /* 00000020: MMC receive status */
#define CH32V203_ETHERNET_MAC_MACSR_MMCTS (1 <<  6) /* 00000040: MMC transmit status */
#define CH32V203_ETHERNET_MAC_MACSR_TSTS  (1 <<  9) /* 00000200: Time stamp trigger status */
#define CH32V203_ETHERNET_MAC_MACIMR_OFFSET 0x003c
#define CH32V203_ETHERNET_MAC_MACIMR      (CH32V203_ETHERNET_MAC_BASE + CH32V203_ETHERNET_MAC_MACIMR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_MAC_MACIMR_PMTIM (1 <<  3) /* 00000008: PMT interrupt mask */
#define CH32V203_ETHERNET_MAC_MACIMR_TSTIM (1 <<  9) /* 00000200: Time stamp trigger interrupt mask */
#define CH32V203_ETHERNET_MAC_MACA0HR_OFFSET 0x0040
#define CH32V203_ETHERNET_MAC_MACA0HR     (CH32V203_ETHERNET_MAC_BASE + CH32V203_ETHERNET_MAC_MACA0HR_OFFSET)
#define CH32V203_ETHERNET_MAC_MACA0HR_MACA0H (0xffff << 0) /* 0000ffff: MAC address0 high */
#define CH32V203_ETHERNET_MAC_MACA0HR_MACA0H_MASK (0xffff << 0)
#define CH32V203_ETHERNET_MAC_MACA0HR_MO  (1 << 31) /* 80000000: Always 1 */
#define CH32V203_ETHERNET_MAC_MACA0LR_OFFSET 0x0044
#define CH32V203_ETHERNET_MAC_MACA0LR     (CH32V203_ETHERNET_MAC_BASE + CH32V203_ETHERNET_MAC_MACA0LR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_MAC_MACA0LR_MACA0L (0xffffffff << 0) /* ffffffff: MAC address0 low */
#define CH32V203_ETHERNET_MAC_MACA0LR_MACA0L_MASK (0xffffffff << 0)
#define CH32V203_ETHERNET_MAC_MACA1HR_OFFSET 0x0048
#define CH32V203_ETHERNET_MAC_MACA1HR     (CH32V203_ETHERNET_MAC_BASE + CH32V203_ETHERNET_MAC_MACA1HR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_MAC_MACA1HR_MACA1H (0xffff << 0) /* 0000ffff: MAC address1 high */
#define CH32V203_ETHERNET_MAC_MACA1HR_MACA1H_MASK (0xffff << 0)
#define CH32V203_ETHERNET_MAC_MACA1HR_MBC (0x3f << 24) /* 3f000000: Mask byte control */
#define CH32V203_ETHERNET_MAC_MACA1HR_MBC_MASK (0x3f << 24)
#define CH32V203_ETHERNET_MAC_MACA1HR_SA  (1 << 30) /* 40000000: Source address */
#define CH32V203_ETHERNET_MAC_MACA1HR_AE  (1 << 31) /* 80000000: Address enable */
#define CH32V203_ETHERNET_MAC_MACA1LR_OFFSET 0x004c
#define CH32V203_ETHERNET_MAC_MACA1LR     (CH32V203_ETHERNET_MAC_BASE + CH32V203_ETHERNET_MAC_MACA1LR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_MAC_MACA1LR_MACA1L (0xffffffff << 0) /* ffffffff: MAC address1 low */
#define CH32V203_ETHERNET_MAC_MACA1LR_MACA1L_MASK (0xffffffff << 0)
#define CH32V203_ETHERNET_MAC_MACA2HR_OFFSET 0x0050
#define CH32V203_ETHERNET_MAC_MACA2HR     (CH32V203_ETHERNET_MAC_BASE + CH32V203_ETHERNET_MAC_MACA2HR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_MAC_MACA2HR_ETH_MACA2HR (0xffff << 0) /* 0000ffff: Ethernet MAC address 2 high register */
#define CH32V203_ETHERNET_MAC_MACA2HR_ETH_MACA2HR_MASK (0xffff << 0)
#define CH32V203_ETHERNET_MAC_MACA2HR_MBC (0x3f << 24) /* 3f000000: Mask byte control */
#define CH32V203_ETHERNET_MAC_MACA2HR_MBC_MASK (0x3f << 24)
#define CH32V203_ETHERNET_MAC_MACA2HR_SA  (1 << 30) /* 40000000: Source address */
#define CH32V203_ETHERNET_MAC_MACA2HR_AE  (1 << 31) /* 80000000: Address enable */
#define CH32V203_ETHERNET_MAC_MACA2LR_OFFSET 0x0054
#define CH32V203_ETHERNET_MAC_MACA2LR     (CH32V203_ETHERNET_MAC_BASE + CH32V203_ETHERNET_MAC_MACA2LR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_MAC_MACA2LR_MACA2L (0x7fffffff << 0) /* 7fffffff: MAC address2 low */
#define CH32V203_ETHERNET_MAC_MACA2LR_MACA2L_MASK (0x7fffffff << 0)
#define CH32V203_ETHERNET_MAC_MACA3HR_OFFSET 0x0058
#define CH32V203_ETHERNET_MAC_MACA3HR     (CH32V203_ETHERNET_MAC_BASE + CH32V203_ETHERNET_MAC_MACA3HR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_MAC_MACA3HR_MACA3H (0xffff << 0) /* 0000ffff: MAC address3 high */
#define CH32V203_ETHERNET_MAC_MACA3HR_MACA3H_MASK (0xffff << 0)
#define CH32V203_ETHERNET_MAC_MACA3HR_MBC (0x3f << 24) /* 3f000000: Mask byte control */
#define CH32V203_ETHERNET_MAC_MACA3HR_MBC_MASK (0x3f << 24)
#define CH32V203_ETHERNET_MAC_MACA3HR_SA  (1 << 30) /* 40000000: Source address */
#define CH32V203_ETHERNET_MAC_MACA3HR_AE  (1 << 31) /* 80000000: Address enable */
#define CH32V203_ETHERNET_MAC_MACA3LR_OFFSET 0x005c
#define CH32V203_ETHERNET_MAC_MACA3LR     (CH32V203_ETHERNET_MAC_BASE + CH32V203_ETHERNET_MAC_MACA3LR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_MAC_MACA3LR_MBCA3L (0xffffffff << 0) /* ffffffff: MAC address3 low */
#define CH32V203_ETHERNET_MAC_MACA3LR_MBCA3L_MASK (0xffffffff << 0)

/* ETHERNET_MMC - Ethernet: MAC management counters */
#define CH32V203_ETHERNET_MMC_BASE        0x40028100
#define CH32V203_ETHERNET_MMC_MMCCR_OFFSET 0x0000
#define CH32V203_ETHERNET_MMC_MMCCR       (CH32V203_ETHERNET_MMC_BASE + CH32V203_ETHERNET_MMC_MMCCR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_MMC_MMCCR_CR    (1 <<  0) /* 00000001: Counter reset */
#define CH32V203_ETHERNET_MMC_MMCCR_CSR   (1 <<  1) /* 00000002: Counter stop rollover */
#define CH32V203_ETHERNET_MMC_MMCCR_ROR   (1 <<  2) /* 00000004: Reset on read */
#define CH32V203_ETHERNET_MMC_MMCCR_MCF   (1 << 31) /* 80000000: MMC counter freeze */
#define CH32V203_ETHERNET_MMC_MMCRIR_OFFSET 0x0004
#define CH32V203_ETHERNET_MMC_MMCRIR      (CH32V203_ETHERNET_MMC_BASE + CH32V203_ETHERNET_MMC_MMCRIR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_MMC_MMCRIR_RFCES (1 <<  5) /* 00000020: Received frames CRC error status */
#define CH32V203_ETHERNET_MMC_MMCRIR_RFAES (1 <<  6) /* 00000040: Received frames alignment error status */
#define CH32V203_ETHERNET_MMC_MMCRIR_RGUFS (1 << 17) /* 00020000: Received Good Unicast Frames Status */
#define CH32V203_ETHERNET_MMC_MMCTIR_OFFSET 0x0008
#define CH32V203_ETHERNET_MMC_MMCTIR      (CH32V203_ETHERNET_MMC_BASE + CH32V203_ETHERNET_MMC_MMCTIR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_MMC_MMCTIR_TGFSCS (1 << 14) /* 00004000: Transmitted good frames single collision status */
#define CH32V203_ETHERNET_MMC_MMCTIR_TGFMSCS (1 << 15) /* 00008000: Transmitted good frames more single collision status */
#define CH32V203_ETHERNET_MMC_MMCTIR_TGFS (1 << 21) /* 00200000: Transmitted good frames status */
#define CH32V203_ETHERNET_MMC_MMCRIMR_OFFSET 0x000c
#define CH32V203_ETHERNET_MMC_MMCRIMR     (CH32V203_ETHERNET_MMC_BASE + CH32V203_ETHERNET_MMC_MMCRIMR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_MMC_MMCRIMR_RFCEM (1 <<  5) /* 00000020: Received frame CRC error mask */
#define CH32V203_ETHERNET_MMC_MMCRIMR_RFAEM (1 <<  6) /* 00000040: Received frames alignment error mask */
#define CH32V203_ETHERNET_MMC_MMCRIMR_RGUFM (1 << 17) /* 00020000: Received good unicast frames mask */
#define CH32V203_ETHERNET_MMC_MMCTIMR_OFFSET 0x0010
#define CH32V203_ETHERNET_MMC_MMCTIMR     (CH32V203_ETHERNET_MMC_BASE + CH32V203_ETHERNET_MMC_MMCTIMR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_MMC_MMCTIMR_TGFSCM (1 << 14) /* 00004000: Transmitted good frames single collision mask */
#define CH32V203_ETHERNET_MMC_MMCTIMR_TGFMSCM (1 << 15) /* 00008000: Transmitted good frames more single collision mask */
#define CH32V203_ETHERNET_MMC_MMCTIMR_TGFM (1 << 21) /* 00200000: Transmitted good frames mask */
#define CH32V203_ETHERNET_MMC_MMCTGFSCCR_OFFSET 0x004c
#define CH32V203_ETHERNET_MMC_MMCTGFSCCR  (CH32V203_ETHERNET_MMC_BASE + CH32V203_ETHERNET_MMC_MMCTGFSCCR_OFFSET) /* read-only */
#define CH32V203_ETHERNET_MMC_MMCTGFSCCR_TGFSCC (0xffffffff << 0) /* ffffffff: Transmitted good frames after a single collision counter */
#define CH32V203_ETHERNET_MMC_MMCTGFSCCR_TGFSCC_MASK (0xffffffff << 0)
#define CH32V203_ETHERNET_MMC_MMCTGFMSCCR_OFFSET 0x0050
#define CH32V203_ETHERNET_MMC_MMCTGFMSCCR (CH32V203_ETHERNET_MMC_BASE + CH32V203_ETHERNET_MMC_MMCTGFMSCCR_OFFSET) /* read-only */
#define CH32V203_ETHERNET_MMC_MMCTGFMSCCR_TGFMSCC (0xffffffff << 0) /* ffffffff: Transmitted good frames after more than a single collision counter */
#define CH32V203_ETHERNET_MMC_MMCTGFMSCCR_TGFMSCC_MASK (0xffffffff << 0)
#define CH32V203_ETHERNET_MMC_MMCTGFCR_OFFSET 0x0068
#define CH32V203_ETHERNET_MMC_MMCTGFCR    (CH32V203_ETHERNET_MMC_BASE + CH32V203_ETHERNET_MMC_MMCTGFCR_OFFSET) /* read-only */
#define CH32V203_ETHERNET_MMC_MMCTGFCR_TGFC (0xffffffff << 0) /* ffffffff: Transmitted good frames counter */
#define CH32V203_ETHERNET_MMC_MMCTGFCR_TGFC_MASK (0xffffffff << 0)
#define CH32V203_ETHERNET_MMC_MMCRFCECR_OFFSET 0x0094
#define CH32V203_ETHERNET_MMC_MMCRFCECR   (CH32V203_ETHERNET_MMC_BASE + CH32V203_ETHERNET_MMC_MMCRFCECR_OFFSET) /* read-only */
#define CH32V203_ETHERNET_MMC_MMCRFCECR_RFCFC (0xffffffff << 0) /* ffffffff: Received frames with CRC error counter */
#define CH32V203_ETHERNET_MMC_MMCRFCECR_RFCFC_MASK (0xffffffff << 0)
#define CH32V203_ETHERNET_MMC_MMCRFAECR_OFFSET 0x0098
#define CH32V203_ETHERNET_MMC_MMCRFAECR   (CH32V203_ETHERNET_MMC_BASE + CH32V203_ETHERNET_MMC_MMCRFAECR_OFFSET) /* read-only */
#define CH32V203_ETHERNET_MMC_MMCRFAECR_RFAEC (0xffffffff << 0) /* ffffffff: Received frames with alignment error counter */
#define CH32V203_ETHERNET_MMC_MMCRFAECR_RFAEC_MASK (0xffffffff << 0)
#define CH32V203_ETHERNET_MMC_MMCRGUFCR_OFFSET 0x00c4
#define CH32V203_ETHERNET_MMC_MMCRGUFCR   (CH32V203_ETHERNET_MMC_BASE + CH32V203_ETHERNET_MMC_MMCRGUFCR_OFFSET) /* read-only */
#define CH32V203_ETHERNET_MMC_MMCRGUFCR_RGUFC (0xffffffff << 0) /* ffffffff: Received good unicast frames counter */
#define CH32V203_ETHERNET_MMC_MMCRGUFCR_RGUFC_MASK (0xffffffff << 0)

/* ETHERNET_PTP - Ethernet: Precision time protocol */
#define CH32V203_ETHERNET_PTP_BASE        0x40028700
#define CH32V203_ETHERNET_PTP_PTPTSCR_OFFSET 0x0000
#define CH32V203_ETHERNET_PTP_PTPTSCR     (CH32V203_ETHERNET_PTP_BASE + CH32V203_ETHERNET_PTP_PTPTSCR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_PTP_PTPTSCR_TSE (1 <<  0) /* 00000001: Time stamp enable */
#define CH32V203_ETHERNET_PTP_PTPTSCR_TSFCU (1 <<  1) /* 00000002: Time stamp fine or coarse update */
#define CH32V203_ETHERNET_PTP_PTPTSCR_TSSTI (1 <<  2) /* 00000004: Time stamp system time initialize */
#define CH32V203_ETHERNET_PTP_PTPTSCR_TSSTU (1 <<  3) /* 00000008: Time stamp system time update */
#define CH32V203_ETHERNET_PTP_PTPTSCR_TSITE (1 <<  4) /* 00000010: Time stamp interrupt trigger enable */
#define CH32V203_ETHERNET_PTP_PTPTSCR_TSARU (1 <<  5) /* 00000020: Time stamp addend register update */
#define CH32V203_ETHERNET_PTP_PTPSSIR_OFFSET 0x0004
#define CH32V203_ETHERNET_PTP_PTPSSIR     (CH32V203_ETHERNET_PTP_BASE + CH32V203_ETHERNET_PTP_PTPSSIR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_PTP_PTPSSIR_STSSI (0xff << 0) /* 000000ff: System time subsecond increment */
#define CH32V203_ETHERNET_PTP_PTPSSIR_STSSI_MASK (0xff << 0)
#define CH32V203_ETHERNET_PTP_PTPTSHR_OFFSET 0x0008
#define CH32V203_ETHERNET_PTP_PTPTSHR     (CH32V203_ETHERNET_PTP_BASE + CH32V203_ETHERNET_PTP_PTPTSHR_OFFSET) /* read-only */
#define CH32V203_ETHERNET_PTP_PTPTSHR_STS (0xffffffff << 0) /* ffffffff: System time second */
#define CH32V203_ETHERNET_PTP_PTPTSHR_STS_MASK (0xffffffff << 0)
#define CH32V203_ETHERNET_PTP_PTPTSLR_OFFSET 0x000c
#define CH32V203_ETHERNET_PTP_PTPTSLR     (CH32V203_ETHERNET_PTP_BASE + CH32V203_ETHERNET_PTP_PTPTSLR_OFFSET) /* read-only */
#define CH32V203_ETHERNET_PTP_PTPTSLR_STSS (0x7fffffff << 0) /* 7fffffff: System time subseconds */
#define CH32V203_ETHERNET_PTP_PTPTSLR_STSS_MASK (0x7fffffff << 0)
#define CH32V203_ETHERNET_PTP_PTPTSLR_STPNS (1 << 31) /* 80000000: System time positive or negative sign */
#define CH32V203_ETHERNET_PTP_PTPTSHUR_OFFSET 0x0010
#define CH32V203_ETHERNET_PTP_PTPTSHUR    (CH32V203_ETHERNET_PTP_BASE + CH32V203_ETHERNET_PTP_PTPTSHUR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_PTP_PTPTSHUR_TSUS (0xffffffff << 0) /* ffffffff: Time stamp update second */
#define CH32V203_ETHERNET_PTP_PTPTSHUR_TSUS_MASK (0xffffffff << 0)
#define CH32V203_ETHERNET_PTP_PTPTSLUR_OFFSET 0x0014
#define CH32V203_ETHERNET_PTP_PTPTSLUR    (CH32V203_ETHERNET_PTP_BASE + CH32V203_ETHERNET_PTP_PTPTSLUR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_PTP_PTPTSLUR_TSUSS (0x7fffffff << 0) /* 7fffffff: Time stamp update subseconds */
#define CH32V203_ETHERNET_PTP_PTPTSLUR_TSUSS_MASK (0x7fffffff << 0)
#define CH32V203_ETHERNET_PTP_PTPTSLUR_TSUPNS (1 << 31) /* 80000000: Time stamp update positive or negative sign */
#define CH32V203_ETHERNET_PTP_PTPTSAR_OFFSET 0x0018
#define CH32V203_ETHERNET_PTP_PTPTSAR     (CH32V203_ETHERNET_PTP_BASE + CH32V203_ETHERNET_PTP_PTPTSAR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_PTP_PTPTSAR_TSA (0xffffffff << 0) /* ffffffff: Time stamp addend */
#define CH32V203_ETHERNET_PTP_PTPTSAR_TSA_MASK (0xffffffff << 0)
#define CH32V203_ETHERNET_PTP_PTPTTHR_OFFSET 0x001c
#define CH32V203_ETHERNET_PTP_PTPTTHR     (CH32V203_ETHERNET_PTP_BASE + CH32V203_ETHERNET_PTP_PTPTTHR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_PTP_PTPTTHR_TTSH (0xffffffff << 0) /* ffffffff: Target time stamp high */
#define CH32V203_ETHERNET_PTP_PTPTTHR_TTSH_MASK (0xffffffff << 0)
#define CH32V203_ETHERNET_PTP_PTPTTLR_OFFSET 0x0020
#define CH32V203_ETHERNET_PTP_PTPTTLR     (CH32V203_ETHERNET_PTP_BASE + CH32V203_ETHERNET_PTP_PTPTTLR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_PTP_PTPTTLR_TTSL (0xffffffff << 0) /* ffffffff: Target time stamp low */
#define CH32V203_ETHERNET_PTP_PTPTTLR_TTSL_MASK (0xffffffff << 0)

