robertlipe/svdtoheaders/demo/h/ch32v20x_reg.h
/* ETHERNET_DMA - Ethernet: DMA controller operation */
#define CH32V203_ETHERNET_DMA_BASE        0x40029000
#define CH32V203_ETHERNET_DMA_DMABMR_OFFSET 0x0000
#define CH32V203_ETHERNET_DMA_DMABMR      (CH32V203_ETHERNET_DMA_BASE + CH32V203_ETHERNET_DMA_DMABMR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_DMA_DMABMR_SR   (1 <<  0) /* 00000001: Software reset */
#define CH32V203_ETHERNET_DMA_DMABMR_DA   (1 <<  1) /* 00000002: DMA Arbitration */
#define CH32V203_ETHERNET_DMA_DMABMR_DSL  (0x1f << 2) /* 0000007c: Descriptor skip length */
#define CH32V203_ETHERNET_DMA_DMABMR_DSL_MASK (0x1f << 2)
#define CH32V203_ETHERNET_DMA_DMABMR_PBL  (0x3f << 8) /* 00003f00: Programmable burst length */
#define CH32V203_ETHERNET_DMA_DMABMR_PBL_MASK (0x3f << 8)
#define CH32V203_ETHERNET_DMA_DMABMR_RTPR (0x3 << 14) /* 0000c000: Rx Tx priority ratio */
#define CH32V203_ETHERNET_DMA_DMABMR_RTPR_MASK (0x3 << 14)
#define CH32V203_ETHERNET_DMA_DMABMR_FB   (1 << 16) /* 00010000: Fixed burst */
#define CH32V203_ETHERNET_DMA_DMABMR_RDP  (0x3f << 17) /* 007e0000: Rx DMA PBL */
#define CH32V203_ETHERNET_DMA_DMABMR_RDP_MASK (0x3f << 17)
#define CH32V203_ETHERNET_DMA_DMABMR_USP  (1 << 23) /* 00800000: Use separate PBL */
#define CH32V203_ETHERNET_DMA_DMABMR_FPM  (1 << 24) /* 01000000: 4xPBL mode */
#define CH32V203_ETHERNET_DMA_DMABMR_AAB  (1 << 25) /* 02000000: Address-aligned beats */
#define CH32V203_ETHERNET_DMA_DMATPDR_OFFSET 0x0004
#define CH32V203_ETHERNET_DMA_DMATPDR     (CH32V203_ETHERNET_DMA_BASE + CH32V203_ETHERNET_DMA_DMATPDR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_DMA_DMATPDR_TPD (0xffffffff << 0) /* ffffffff: Transmit poll demand */
#define CH32V203_ETHERNET_DMA_DMATPDR_TPD_MASK (0xffffffff << 0)
#define CH32V203_ETHERNET_DMA_DMARPDR_OFFSET 0x0008
#define CH32V203_ETHERNET_DMA_DMARPDR     (CH32V203_ETHERNET_DMA_BASE + CH32V203_ETHERNET_DMA_DMARPDR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_DMA_DMARPDR_RPD (0xffffffff << 0) /* ffffffff: Receive poll demand */
#define CH32V203_ETHERNET_DMA_DMARPDR_RPD_MASK (0xffffffff << 0)
#define CH32V203_ETHERNET_DMA_DMARDLAR_OFFSET 0x000c
#define CH32V203_ETHERNET_DMA_DMARDLAR    (CH32V203_ETHERNET_DMA_BASE + CH32V203_ETHERNET_DMA_DMARDLAR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_DMA_DMARDLAR_SRL (0xffffffff << 0) /* ffffffff: Start of receive list */
#define CH32V203_ETHERNET_DMA_DMARDLAR_SRL_MASK (0xffffffff << 0)
#define CH32V203_ETHERNET_DMA_DMATDLAR_OFFSET 0x0010
#define CH32V203_ETHERNET_DMA_DMATDLAR    (CH32V203_ETHERNET_DMA_BASE + CH32V203_ETHERNET_DMA_DMATDLAR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_DMA_DMATDLAR_STL (0xffffffff << 0) /* ffffffff: Start of transmit list */
#define CH32V203_ETHERNET_DMA_DMATDLAR_STL_MASK (0xffffffff << 0)
#define CH32V203_ETHERNET_DMA_DMASR_OFFSET 0x0014
#define CH32V203_ETHERNET_DMA_DMASR       (CH32V203_ETHERNET_DMA_BASE + CH32V203_ETHERNET_DMA_DMASR_OFFSET)
#define CH32V203_ETHERNET_DMA_DMASR_TS    (1 <<  0) /* 00000001: Transmit status */
#define CH32V203_ETHERNET_DMA_DMASR_TPSS  (1 <<  1) /* 00000002: Transmit process stopped status */
#define CH32V203_ETHERNET_DMA_DMASR_TBUS  (1 <<  2) /* 00000004: Transmit buffer unavailable status */
#define CH32V203_ETHERNET_DMA_DMASR_TJTS  (1 <<  3) /* 00000008: Transmit jabber timeout status */
#define CH32V203_ETHERNET_DMA_DMASR_ROS   (1 <<  4) /* 00000010: Receive overflow status */
#define CH32V203_ETHERNET_DMA_DMASR_TUS   (1 <<  5) /* 00000020: Transmit underflow status */
#define CH32V203_ETHERNET_DMA_DMASR_RS    (1 <<  6) /* 00000040: Receive status */
#define CH32V203_ETHERNET_DMA_DMASR_RBUS  (1 <<  7) /* 00000080: Receive buffer unavailable status */
#define CH32V203_ETHERNET_DMA_DMASR_RPSS  (1 <<  8) /* 00000100: Receive process stopped status */
#define CH32V203_ETHERNET_DMA_DMASR_PWTS  (1 <<  9) /* 00000200: Receive watchdog timeout status */
#define CH32V203_ETHERNET_DMA_DMASR_ETS   (1 << 10) /* 00000400: Early transmit status */
#define CH32V203_ETHERNET_DMA_DMASR_FBES  (1 << 13) /* 00002000: Fatal bus error status */
#define CH32V203_ETHERNET_DMA_DMASR_ERS   (1 << 14) /* 00004000: Early receive status */
#define CH32V203_ETHERNET_DMA_DMASR_AIS   (1 << 15) /* 00008000: Abnormal interrupt summary */
#define CH32V203_ETHERNET_DMA_DMASR_NIS   (1 << 16) /* 00010000: Normal interrupt summary */
#define CH32V203_ETHERNET_DMA_DMASR_RPS   (0x7 << 17) /* 000e0000: Receive process state */
#define CH32V203_ETHERNET_DMA_DMASR_RPS_MASK (0x7 << 17)
#define CH32V203_ETHERNET_DMA_DMASR_TPS   (0x7 << 20) /* 00700000: Transmit process state */
#define CH32V203_ETHERNET_DMA_DMASR_TPS_MASK (0x7 << 20)
#define CH32V203_ETHERNET_DMA_DMASR_EBS   (0x7 << 23) /* 03800000: Error bits status */
#define CH32V203_ETHERNET_DMA_DMASR_EBS_MASK (0x7 << 23)
#define CH32V203_ETHERNET_DMA_DMASR_MMCS  (1 << 27) /* 08000000: MMC status */
#define CH32V203_ETHERNET_DMA_DMASR_PMTS  (1 << 28) /* 10000000: PMT status */
#define CH32V203_ETHERNET_DMA_DMASR_TSTS  (1 << 29) /* 20000000: Time stamp trigger status */
#define CH32V203_ETHERNET_DMA_DMASR_IPLS  (1 << 31) /* 80000000: 10MPHY Physical layer variation */
#define CH32V203_ETHERNET_DMA_DMAOMR_OFFSET 0x0018
#define CH32V203_ETHERNET_DMA_DMAOMR      (CH32V203_ETHERNET_DMA_BASE + CH32V203_ETHERNET_DMA_DMAOMR_OFFSET) /* read-write */
#define CH32V203_ETHERNET_DMA_DMAOMR_SR   (1 <<  1) /* 00000002: SR */
#define CH32V203_ETHERNET_DMA_DMAOMR_OSF  (1 <<  2) /* 00000004: OSF */
#define CH32V203_ETHERNET_DMA_DMAOMR_RTC  (0x3 << 3) /* 00000018: RTC */
#define CH32V203_ETHERNET_DMA_DMAOMR_RTC_MASK (0x3 << 3)
#define CH32V203_ETHERNET_DMA_DMAOMR_FUGF (1 <<  6) /* 00000040: FUGF */
#define CH32V203_ETHERNET_DMA_DMAOMR_FEF  (1 <<  7) /* 00000080: FEF */
#define CH32V203_ETHERNET_DMA_DMAOMR_ST   (1 << 13) /* 00002000: ST */
#define CH32V203_ETHERNET_DMA_DMAOMR_TTC  (0x7 << 14) /* 0001c000: TTC */
#define CH32V203_ETHERNET_DMA_DMAOMR_TTC_MASK (0x7 << 14)
#define CH32V203_ETHERNET_DMA_DMAOMR_FTF  (1 << 20) /* 00100000: FTF */
#define CH32V203_ETHERNET_DMA_DMAOMR_TSF  (1 << 21) /* 00200000: TSF */
#define CH32V203_ETHERNET_DMA_DMAOMR_DFRF (1 << 24) /* 01000000: DFRF */
#define CH32V203_ETHERNET_DMA_DMAOMR_RSF  (1 << 25) /* 02000000: RSF */
#define CH32V203_ETHERNET_DMA_DMAOMR_DTCEFD (1 << 26) /* 04000000: DTCEFD */
#define CH32V203_ETHERNET_DMA_DMAIER_OFFSET 0x001c
#define CH32V203_ETHERNET_DMA_DMAIER      (CH32V203_ETHERNET_DMA_BASE + CH32V203_ETHERNET_DMA_DMAIER_OFFSET) /* read-write */
#define CH32V203_ETHERNET_DMA_DMAIER_TIE  (1 <<  0) /* 00000001: Transmit interrupt enable */
#define CH32V203_ETHERNET_DMA_DMAIER_TPSIE (1 <<  1) /* 00000002: Transmit process stopped interrupt enable */
#define CH32V203_ETHERNET_DMA_DMAIER_TBUIE (1 <<  2) /* 00000004: Transmit buffer unavailable interrupt enable */
#define CH32V203_ETHERNET_DMA_DMAIER_TJTIE (1 <<  3) /* 00000008: Transmit jabber timeout interrupt enable */
#define CH32V203_ETHERNET_DMA_DMAIER_ROIE (1 <<  4) /* 00000010: Overflow interrupt enable */
#define CH32V203_ETHERNET_DMA_DMAIER_TUIE (1 <<  5) /* 00000020: Underflow interrupt enable */
#define CH32V203_ETHERNET_DMA_DMAIER_RIE  (1 <<  6) /* 00000040: Receive interrupt enable */
#define CH32V203_ETHERNET_DMA_DMAIER_RBUIE (1 <<  7) /* 00000080: Receive buffer unavailable interrupt enable */
#define CH32V203_ETHERNET_DMA_DMAIER_RPSIE (1 <<  8) /* 00000100: Receive process stopped interrupt enable */
#define CH32V203_ETHERNET_DMA_DMAIER_RWTIE (1 <<  9) /* 00000200: receive watchdog timeout interrupt enable */
#define CH32V203_ETHERNET_DMA_DMAIER_ETIE (1 << 10) /* 00000400: Early transmit interrupt enable */
#define CH32V203_ETHERNET_DMA_DMAIER_FBEIE (1 << 13) /* 00002000: Fatal bus error interrupt enable */
#define CH32V203_ETHERNET_DMA_DMAIER_ERIE (1 << 14) /* 00004000: Early receive interrupt enable */
#define CH32V203_ETHERNET_DMA_DMAIER_AISE (1 << 15) /* 00008000: Abnormal interrupt summary enable */
#define CH32V203_ETHERNET_DMA_DMAIER_NISE (1 << 16) /* 00010000: Normal interrupt summary enable */
#define CH32V203_ETHERNET_DMA_DMAIER_IPLE (1 << 31) /* 80000000: 10M Physical layer connection */
#define CH32V203_ETHERNET_DMA_DMAMFBOCR_OFFSET 0x0020
#define CH32V203_ETHERNET_DMA_DMAMFBOCR   (CH32V203_ETHERNET_DMA_BASE + CH32V203_ETHERNET_DMA_DMAMFBOCR_OFFSET) /* read-only */
#define CH32V203_ETHERNET_DMA_DMAMFBOCR_MFC (0xffff << 0) /* 0000ffff: Missed frames by the controller */
#define CH32V203_ETHERNET_DMA_DMAMFBOCR_MFC_MASK (0xffff << 0)
#define CH32V203_ETHERNET_DMA_DMAMFBOCR_OMFC (1 << 16) /* 00010000: Overflow bit for missed frame counter */
#define CH32V203_ETHERNET_DMA_DMAMFBOCR_MFA (0x7ff << 17) /* 0ffe0000: Missed frames by the application */
#define CH32V203_ETHERNET_DMA_DMAMFBOCR_MFA_MASK (0x7ff << 17)
#define CH32V203_ETHERNET_DMA_DMAMFBOCR_OFOC (1 << 28) /* 10000000: Overflow bit for FIFO overflow counter */
#define CH32V203_ETHERNET_DMA_DMACHTDR_OFFSET 0x0048
#define CH32V203_ETHERNET_DMA_DMACHTDR    (CH32V203_ETHERNET_DMA_BASE + CH32V203_ETHERNET_DMA_DMACHTDR_OFFSET) /* read-only */
#define CH32V203_ETHERNET_DMA_DMACHTDR_HTDAP (0xffffffff << 0) /* ffffffff: Host transmit descriptor address pointer */
#define CH32V203_ETHERNET_DMA_DMACHTDR_HTDAP_MASK (0xffffffff << 0)
#define CH32V203_ETHERNET_DMA_DMACHRDR_OFFSET 0x004c
#define CH32V203_ETHERNET_DMA_DMACHRDR    (CH32V203_ETHERNET_DMA_BASE + CH32V203_ETHERNET_DMA_DMACHRDR_OFFSET) /* read-only */
#define CH32V203_ETHERNET_DMA_DMACHRDR_HRDAP (0xffffffff << 0) /* ffffffff: Host receive descriptor address pointer */
#define CH32V203_ETHERNET_DMA_DMACHRDR_HRDAP_MASK (0xffffffff << 0)
#define CH32V203_ETHERNET_DMA_DMACHTBAR_OFFSET 0x0050
#define CH32V203_ETHERNET_DMA_DMACHTBAR   (CH32V203_ETHERNET_DMA_BASE + CH32V203_ETHERNET_DMA_DMACHTBAR_OFFSET) /* read-only */
#define CH32V203_ETHERNET_DMA_DMACHTBAR_HTBAP (0xffffffff << 0) /* ffffffff: Host transmit buffer address pointer */
#define CH32V203_ETHERNET_DMA_DMACHTBAR_HTBAP_MASK (0xffffffff << 0)
#define CH32V203_ETHERNET_DMA_DMACHRBAR_OFFSET 0x0054
#define CH32V203_ETHERNET_DMA_DMACHRBAR   (CH32V203_ETHERNET_DMA_BASE + CH32V203_ETHERNET_DMA_DMACHRBAR_OFFSET) /* read-only */
#define CH32V203_ETHERNET_DMA_DMACHRBAR_HRBAP (0xffffffff << 0) /* ffffffff: Host receive buffer address pointer */
#define CH32V203_ETHERNET_DMA_DMACHRBAR_HRBAP_MASK (0xffffffff << 0)

/* DAC - Digital to analog converter */
#define CH32V203_DAC_BASE                 0x40007400
#define CH32V203_DAC_CTLR_OFFSET          0x0000
#define CH32V203_DAC_CTLR                 (CH32V203_DAC_BASE + CH32V203_DAC_CTLR_OFFSET) /* read-write */
#define CH32V203_DAC_CTLR_EN1             (1 <<  0) /* 00000001: DAC channel1 enable */
#define CH32V203_DAC_CTLR_BOFF1           (1 <<  1) /* 00000002: DAC channel1 output buffer disable */
#define CH32V203_DAC_CTLR_TEN1            (1 <<  2) /* 00000004: DAC channel1 trigger enable */
#define CH32V203_DAC_CTLR_TSEL1           (0x7 << 3) /* 00000038: DAC channel1 trigger selection */
#define CH32V203_DAC_CTLR_TSEL1_MASK      (0x7 << 3)
#define CH32V203_DAC_CTLR_WAVE1           (0x3 << 6) /* 000000c0: DAC channel1 noise/triangle wave generation enable */
#define CH32V203_DAC_CTLR_WAVE1_MASK      (0x3 << 6)
#define CH32V203_DAC_CTLR_MAMP1           (0xf << 8) /* 00000f00: DAC channel1 mask/amplitude selector */
#define CH32V203_DAC_CTLR_MAMP1_MASK      (0xf << 8)
#define CH32V203_DAC_CTLR_DMAEN1          (1 << 12) /* 00001000: DAC channel1 DMA enable */
#define CH32V203_DAC_CTLR_EN2             (1 << 16) /* 00010000: DAC channel2 enable */
#define CH32V203_DAC_CTLR_BOFF2           (1 << 17) /* 00020000: DAC channel2 output buffer disable */
#define CH32V203_DAC_CTLR_TEN2            (1 << 18) /* 00040000: DAC channel2 trigger enable */
#define CH32V203_DAC_CTLR_TSEL2           (0x7 << 19) /* 00380000: DAC channel2 trigger selection */
#define CH32V203_DAC_CTLR_TSEL2_MASK      (0x7 << 19)
#define CH32V203_DAC_CTLR_WAVE2           (0x3 << 22) /* 00c00000: DAC channel2 noise/triangle wave generation enable */
#define CH32V203_DAC_CTLR_WAVE2_MASK      (0x3 << 22)
#define CH32V203_DAC_CTLR_MAMP2           (0xf << 24) /* 0f000000: DAC channel2 mask/amplitude selector */
#define CH32V203_DAC_CTLR_MAMP2_MASK      (0xf << 24)
#define CH32V203_DAC_CTLR_DMAEN2          (1 << 28) /* 10000000: DAC channel2 DMA enable */
#define CH32V203_DAC_SWTR_OFFSET          0x0004
#define CH32V203_DAC_SWTR                 (CH32V203_DAC_BASE + CH32V203_DAC_SWTR_OFFSET) /* write-only */
#define CH32V203_DAC_SWTR_SWTRIG1         (1 <<  0) /* 00000001: DAC channel1 software trigger */
#define CH32V203_DAC_SWTR_SWTRIG2         (1 <<  1) /* 00000002: DAC channel2 software trigger */
#define CH32V203_DAC_R12BDHR1_OFFSET      0x0008
#define CH32V203_DAC_R12BDHR1             (CH32V203_DAC_BASE + CH32V203_DAC_R12BDHR1_OFFSET) /* read-write */
#define CH32V203_DAC_R12BDHR1_DACC1DHR    (0xfff << 0) /* 00000fff: DAC channel1 12-bit right-aligned data */
#define CH32V203_DAC_R12BDHR1_DACC1DHR_MASK (0xfff << 0)
#define CH32V203_DAC_L12BDHR1_OFFSET      0x000c
#define CH32V203_DAC_L12BDHR1             (CH32V203_DAC_BASE + CH32V203_DAC_L12BDHR1_OFFSET) /* read-write */
#define CH32V203_DAC_L12BDHR1_DACC1DHR    (0xfff << 4) /* 0000fff0: DAC channel1 12-bit left-aligned data */
#define CH32V203_DAC_L12BDHR1_DACC1DHR_MASK (0xfff << 4)
#define CH32V203_DAC_R8BDHR1_OFFSET       0x0010
#define CH32V203_DAC_R8BDHR1              (CH32V203_DAC_BASE + CH32V203_DAC_R8BDHR1_OFFSET) /* read-write */
#define CH32V203_DAC_R8BDHR1_DACC1DHR     (0xff << 0) /* 000000ff: DAC channel1 8-bit right-aligned data */
#define CH32V203_DAC_R8BDHR1_DACC1DHR_MASK (0xff << 0)
#define CH32V203_DAC_R12BDHR2_OFFSET      0x0014
#define CH32V203_DAC_R12BDHR2             (CH32V203_DAC_BASE + CH32V203_DAC_R12BDHR2_OFFSET) /* read-write */
#define CH32V203_DAC_R12BDHR2_DACC2DHR    (0xfff << 0) /* 00000fff: DAC channel2 12-bit right-aligned data */
#define CH32V203_DAC_R12BDHR2_DACC2DHR_MASK (0xfff << 0)
#define CH32V203_DAC_L12BDHR2_OFFSET      0x0018
#define CH32V203_DAC_L12BDHR2             (CH32V203_DAC_BASE + CH32V203_DAC_L12BDHR2_OFFSET) /* read-write */
#define CH32V203_DAC_L12BDHR2_DACC2DHR    (0xfff << 4) /* 0000fff0: DAC channel2 12-bit left-aligned data */
#define CH32V203_DAC_L12BDHR2_DACC2DHR_MASK (0xfff << 4)
#define CH32V203_DAC_R8BDHR2_OFFSET       0x001c
#define CH32V203_DAC_R8BDHR2              (CH32V203_DAC_BASE + CH32V203_DAC_R8BDHR2_OFFSET) /* read-write */
#define CH32V203_DAC_R8BDHR2_DACC2DHR     (0xff << 0) /* 000000ff: DAC channel2 8-bit right-aligned data */
#define CH32V203_DAC_R8BDHR2_DACC2DHR_MASK (0xff << 0)
#define CH32V203_DAC_RD12BDHR_OFFSET      0x0020
#define CH32V203_DAC_RD12BDHR             (CH32V203_DAC_BASE + CH32V203_DAC_RD12BDHR_OFFSET) /* read-write */
#define CH32V203_DAC_RD12BDHR_DACC1DHR    (0xfff << 0) /* 00000fff: DAC channel1 12-bit right-aligned data */
#define CH32V203_DAC_RD12BDHR_DACC1DHR_MASK (0xfff << 0)
#define CH32V203_DAC_RD12BDHR_DACC2DHR    (0xfff << 16) /* 0fff0000: DAC channel2 12-bit right-aligned data */
#define CH32V203_DAC_RD12BDHR_DACC2DHR_MASK (0xfff << 16)
#define CH32V203_DAC_LD12BDHR_OFFSET      0x0024
#define CH32V203_DAC_LD12BDHR             (CH32V203_DAC_BASE + CH32V203_DAC_LD12BDHR_OFFSET) /* read-write */
#define CH32V203_DAC_LD12BDHR_DACC1DHR    (0xfff << 4) /* 0000fff0: DAC channel1 12-bit left-aligned data */
#define CH32V203_DAC_LD12BDHR_DACC1DHR_MASK (0xfff << 4)
#define CH32V203_DAC_LD12BDHR_DACC2DHR    (0xfff << 20) /* fff00000: DAC channel2 12-bit right-aligned data */
#define CH32V203_DAC_LD12BDHR_DACC2DHR_MASK (0xfff << 20)
#define CH32V203_DAC_RD8BDHR_OFFSET       0x0028
#define CH32V203_DAC_RD8BDHR              (CH32V203_DAC_BASE + CH32V203_DAC_RD8BDHR_OFFSET) /* read-write */
#define CH32V203_DAC_RD8BDHR_DACC1DHR     (0xff << 0) /* 000000ff: DAC channel1 8-bit right-aligned data */
#define CH32V203_DAC_RD8BDHR_DACC1DHR_MASK (0xff << 0)
#define CH32V203_DAC_RD8BDHR_DACC2DHR     (0xff << 8) /* 0000ff00: DAC channel2 8-bit right-aligned data */
#define CH32V203_DAC_RD8BDHR_DACC2DHR_MASK (0xff << 8)
#define CH32V203_DAC_DOR1_OFFSET          0x002c
#define CH32V203_DAC_DOR1                 (CH32V203_DAC_BASE + CH32V203_DAC_DOR1_OFFSET) /* read-only */
#define CH32V203_DAC_DOR1_DACC1DOR        (0xfff << 0) /* 00000fff: DAC channel1 data output */
#define CH32V203_DAC_DOR1_DACC1DOR_MASK   (0xfff << 0)
#define CH32V203_DAC_DOR2_OFFSET          0x0030
#define CH32V203_DAC_DOR2                 (CH32V203_DAC_BASE + CH32V203_DAC_DOR2_OFFSET) /* read-only */
#define CH32V203_DAC_DOR2_DACC2DOR        (0xfff << 0) /* 00000fff: DAC channel2 data output */
#define CH32V203_DAC_DOR2_DACC2DOR_MASK   (0xfff << 0)

/* PWR - Power control */
#define CH32V203_PWR_BASE                 0x40007000
#define CH32V203_PWR_CTLR_OFFSET          0x0000
#define CH32V203_PWR_CTLR                 (CH32V203_PWR_BASE + CH32V203_PWR_CTLR_OFFSET) /* read-write */
#define CH32V203_PWR_CTLR_LPDS            (1 <<  0) /* 00000001: Low Power Deep Sleep */
#define CH32V203_PWR_CTLR_PDDS            (1 <<  1) /* 00000002: Power Down Deep Sleep */
#define CH32V203_PWR_CTLR_CWUF            (1 <<  2) /* 00000004: Clear Wake-up Flag */
#define CH32V203_PWR_CTLR_CSBF            (1 <<  3) /* 00000008: Clear STANDBY Flag */
#define CH32V203_PWR_CTLR_PVDE            (1 <<  4) /* 00000010: Power Voltage Detector Enable */
#define CH32V203_PWR_CTLR_PLS             (0x7 << 5) /* 000000e0: PVD Level Selection */
#define CH32V203_PWR_CTLR_PLS_MASK        (0x7 << 5)
#define CH32V203_PWR_CTLR_DBP             (1 <<  8) /* 00000100: Disable Backup Domain write protection */
#define CH32V203_PWR_CTLR_R2K_STYEN       (1 << 16) /* 00010000: standby 2k ram enable */
#define CH32V203_PWR_CTLR_R30K_STYEN      (1 << 17) /* 00020000: standby 30k ram enable */
#define CH32V203_PWR_CTLR_R2K_VBATEN      (1 << 18) /* 00040000: VBAT 30k ram enable */
#define CH32V203_PWR_CTLR_R30K_VBATEN     (1 << 19) /* 00080000: VBAT 30k ram enable */
#define CH32V203_PWR_CTLR_RAM_LVEN        (1 << 20) /* 00100000: Ram LV Enable */
#define CH32V203_PWR_CSR_OFFSET           0x0004
#define CH32V203_PWR_CSR                  (CH32V203_PWR_BASE + CH32V203_PWR_CSR_OFFSET)
#define CH32V203_PWR_CSR_WUF              (1 <<  0) /* 00000001: Wake-Up Flag */
#define CH32V203_PWR_CSR_SBF              (1 <<  1) /* 00000002: STANDBY Flag */
#define CH32V203_PWR_CSR_PVDO             (1 <<  2) /* 00000004: PVD Output */
#define CH32V203_PWR_CSR_EWUP             (1 <<  8) /* 00000100: Enable WKUP pin */

