robertlipe/svdtoheaders/demo/h/ch32v20x_reg.h
#define CH32V203_DMA1_CFGR8_TEIE          (1 <<  3) /* 00000008: Transfer error interrupt enable */
#define CH32V203_DMA1_CFGR8_DIR           (1 <<  4) /* 00000010: Data transfer direction */
#define CH32V203_DMA1_CFGR8_CIRC          (1 <<  5) /* 00000020: Circular mode */
#define CH32V203_DMA1_CFGR8_PINC          (1 <<  6) /* 00000040: Peripheral increment mode */
#define CH32V203_DMA1_CFGR8_MINC          (1 <<  7) /* 00000080: Memory increment mode */
#define CH32V203_DMA1_CFGR8_PSIZE         (0x3 << 8) /* 00000300: Peripheral size */
#define CH32V203_DMA1_CFGR8_PSIZE_MASK    (0x3 << 8)
#define CH32V203_DMA1_CFGR8_MSIZE         (0x3 << 10) /* 00000c00: Memory size */
#define CH32V203_DMA1_CFGR8_MSIZE_MASK    (0x3 << 10)
#define CH32V203_DMA1_CFGR8_PL            (0x3 << 12) /* 00003000: Channel Priority level */
#define CH32V203_DMA1_CFGR8_PL_MASK       (0x3 << 12)
#define CH32V203_DMA1_CFGR8_MEM2MEM       (1 << 14) /* 00004000: Memory to memory mode */
#define CH32V203_DMA1_CNTR8_OFFSET        0x0098
#define CH32V203_DMA1_CNTR8               (CH32V203_DMA1_BASE + CH32V203_DMA1_CNTR8_OFFSET) /* read-write */
#define CH32V203_DMA1_CNTR8_NDT           (0xffff << 0) /* 0000ffff: Number of data to transfer */
#define CH32V203_DMA1_CNTR8_NDT_MASK      (0xffff << 0)
#define CH32V203_DMA1_PADDR8_OFFSET       0x009c
#define CH32V203_DMA1_PADDR8              (CH32V203_DMA1_BASE + CH32V203_DMA1_PADDR8_OFFSET) /* read-write */
#define CH32V203_DMA1_PADDR8_PA           (0xffffffff << 0) /* ffffffff: Peripheral address */
#define CH32V203_DMA1_PADDR8_PA_MASK      (0xffffffff << 0)
#define CH32V203_DMA1_MADDR8_OFFSET       0x00a0
#define CH32V203_DMA1_MADDR8              (CH32V203_DMA1_BASE + CH32V203_DMA1_MADDR8_OFFSET) /* read-write */
#define CH32V203_DMA1_MADDR8_MA           (0xffffffff << 0) /* ffffffff: Memory address */
#define CH32V203_DMA1_MADDR8_MA_MASK      (0xffffffff << 0)

/* RTC - Real time clock */
#define CH32V203_RTC_BASE                 0x40002800
#define CH32V203_RTC_CTLRH_OFFSET         0x0000
#define CH32V203_RTC_CTLRH                (CH32V203_RTC_BASE + CH32V203_RTC_CTLRH_OFFSET) /* read-write */
#define CH32V203_RTC_CTLRH_SECIE          (1 <<  0) /* 00000001: Second interrupt Enable */
#define CH32V203_RTC_CTLRH_ALRIE          (1 <<  1) /* 00000002: Alarm interrupt Enable */
#define CH32V203_RTC_CTLRH_OWIE           (1 <<  2) /* 00000004: Overflow interrupt Enable */
#define CH32V203_RTC_CTLRL_OFFSET         0x0004
#define CH32V203_RTC_CTLRL                (CH32V203_RTC_BASE + CH32V203_RTC_CTLRL_OFFSET)
#define CH32V203_RTC_CTLRL_SECF           (1 <<  0) /* 00000001: Second Flag */
#define CH32V203_RTC_CTLRL_ALRF           (1 <<  1) /* 00000002: Alarm Flag */
#define CH32V203_RTC_CTLRL_OWF            (1 <<  2) /* 00000004: Overflow Flag */
#define CH32V203_RTC_CTLRL_RSF            (1 <<  3) /* 00000008: Registers Synchronized Flag */
#define CH32V203_RTC_CTLRL_CNF            (1 <<  4) /* 00000010: Configuration Flag */
#define CH32V203_RTC_CTLRL_RTOFF          (1 <<  5) /* 00000020: RTC operation OFF */
#define CH32V203_RTC_PSCRH_OFFSET         0x0008
#define CH32V203_RTC_PSCRH                (CH32V203_RTC_BASE + CH32V203_RTC_PSCRH_OFFSET) /* write-only */
#define CH32V203_RTC_PSCRH_PRLH           (0xf << 0) /* 0000000f: RTC Prescaler Load Register High */
#define CH32V203_RTC_PSCRH_PRLH_MASK      (0xf << 0)
#define CH32V203_RTC_PSCRL_OFFSET         0x000c
#define CH32V203_RTC_PSCRL                (CH32V203_RTC_BASE + CH32V203_RTC_PSCRL_OFFSET) /* write-only */
#define CH32V203_RTC_PSCRL_PRLL           (0xffff << 0) /* 0000ffff: RTC Prescaler Divider Register Low */
#define CH32V203_RTC_PSCRL_PRLL_MASK      (0xffff << 0)
#define CH32V203_RTC_DIVH_OFFSET          0x0010
#define CH32V203_RTC_DIVH                 (CH32V203_RTC_BASE + CH32V203_RTC_DIVH_OFFSET) /* read-only */
#define CH32V203_RTC_DIVH_DIVH            (0xf << 0) /* 0000000f: RTC prescaler divider register high */
#define CH32V203_RTC_DIVH_DIVH_MASK       (0xf << 0)
#define CH32V203_RTC_DIVL_OFFSET          0x0014
#define CH32V203_RTC_DIVL                 (CH32V203_RTC_BASE + CH32V203_RTC_DIVL_OFFSET) /* read-only */
#define CH32V203_RTC_DIVL_DIVL            (0xffff << 0) /* 0000ffff: RTC prescaler divider register Low */
#define CH32V203_RTC_DIVL_DIVL_MASK       (0xffff << 0)
#define CH32V203_RTC_CNTH_OFFSET          0x0018
#define CH32V203_RTC_CNTH                 (CH32V203_RTC_BASE + CH32V203_RTC_CNTH_OFFSET) /* read-write */
#define CH32V203_RTC_CNTH_CNTH            (0xffff << 0) /* 0000ffff: RTC counter register high */
#define CH32V203_RTC_CNTH_CNTH_MASK       (0xffff << 0)
#define CH32V203_RTC_CNTL_OFFSET          0x001c
#define CH32V203_RTC_CNTL                 (CH32V203_RTC_BASE + CH32V203_RTC_CNTL_OFFSET) /* read-write */
#define CH32V203_RTC_CNTL_CNTL            (0xffff << 0) /* 0000ffff: RTC counter register Low */
#define CH32V203_RTC_CNTL_CNTL_MASK       (0xffff << 0)
#define CH32V203_RTC_ALRMH_OFFSET         0x0020
#define CH32V203_RTC_ALRMH                (CH32V203_RTC_BASE + CH32V203_RTC_ALRMH_OFFSET) /* write-only */
#define CH32V203_RTC_ALRMH_ALRH           (0xffff << 0) /* 0000ffff: RTC alarm register high */
#define CH32V203_RTC_ALRMH_ALRH_MASK      (0xffff << 0)
#define CH32V203_RTC_ALRML_OFFSET         0x0024
#define CH32V203_RTC_ALRML                (CH32V203_RTC_BASE + CH32V203_RTC_ALRML_OFFSET) /* write-only */
#define CH32V203_RTC_ALRML_ALRL           (0xffff << 0) /* 0000ffff: RTC alarm register low */
#define CH32V203_RTC_ALRML_ALRL_MASK      (0xffff << 0)

/* BKP - Backup registers */
#define CH32V203_BKP_BASE                 0x40006c00
#define CH32V203_BKP_DATAR1_OFFSET        0x0004
#define CH32V203_BKP_DATAR1               (CH32V203_BKP_BASE + CH32V203_BKP_DATAR1_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR1_D1            (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR1_D1_MASK       (0xffff << 0)
#define CH32V203_BKP_DATAR2_OFFSET        0x0008
#define CH32V203_BKP_DATAR2               (CH32V203_BKP_BASE + CH32V203_BKP_DATAR2_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR2_D2            (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR2_D2_MASK       (0xffff << 0)
#define CH32V203_BKP_DATAR3_OFFSET        0x000c
#define CH32V203_BKP_DATAR3               (CH32V203_BKP_BASE + CH32V203_BKP_DATAR3_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR3_D3            (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR3_D3_MASK       (0xffff << 0)
#define CH32V203_BKP_DATAR4_OFFSET        0x0010
#define CH32V203_BKP_DATAR4               (CH32V203_BKP_BASE + CH32V203_BKP_DATAR4_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR4_D4            (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR4_D4_MASK       (0xffff << 0)
#define CH32V203_BKP_DATAR5_OFFSET        0x0014
#define CH32V203_BKP_DATAR5               (CH32V203_BKP_BASE + CH32V203_BKP_DATAR5_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR5_D5            (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR5_D5_MASK       (0xffff << 0)
#define CH32V203_BKP_DATAR6_OFFSET        0x0018
#define CH32V203_BKP_DATAR6               (CH32V203_BKP_BASE + CH32V203_BKP_DATAR6_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR6_D6            (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR6_D6_MASK       (0xffff << 0)
#define CH32V203_BKP_DATAR7_OFFSET        0x001c
#define CH32V203_BKP_DATAR7               (CH32V203_BKP_BASE + CH32V203_BKP_DATAR7_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR7_D7            (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR7_D7_MASK       (0xffff << 0)
#define CH32V203_BKP_DATAR8_OFFSET        0x0020
#define CH32V203_BKP_DATAR8               (CH32V203_BKP_BASE + CH32V203_BKP_DATAR8_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR8_D8            (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR8_D8_MASK       (0xffff << 0)
#define CH32V203_BKP_DATAR9_OFFSET        0x0024
#define CH32V203_BKP_DATAR9               (CH32V203_BKP_BASE + CH32V203_BKP_DATAR9_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR9_D9            (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR9_D9_MASK       (0xffff << 0)
#define CH32V203_BKP_DATAR10_OFFSET       0x0028
#define CH32V203_BKP_DATAR10              (CH32V203_BKP_BASE + CH32V203_BKP_DATAR10_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR10_D10          (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR10_D10_MASK     (0xffff << 0)
#define CH32V203_BKP_DATAR11_OFFSET       0x0040
#define CH32V203_BKP_DATAR11              (CH32V203_BKP_BASE + CH32V203_BKP_DATAR11_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR11_DR11         (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR11_DR11_MASK    (0xffff << 0)
#define CH32V203_BKP_DATAR12_OFFSET       0x0044
#define CH32V203_BKP_DATAR12              (CH32V203_BKP_BASE + CH32V203_BKP_DATAR12_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR12_DR12         (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR12_DR12_MASK    (0xffff << 0)
#define CH32V203_BKP_DATAR13_OFFSET       0x0048
#define CH32V203_BKP_DATAR13              (CH32V203_BKP_BASE + CH32V203_BKP_DATAR13_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR13_DR13         (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR13_DR13_MASK    (0xffff << 0)
#define CH32V203_BKP_DATAR14_OFFSET       0x004c
#define CH32V203_BKP_DATAR14              (CH32V203_BKP_BASE + CH32V203_BKP_DATAR14_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR14_D14          (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR14_D14_MASK     (0xffff << 0)
#define CH32V203_BKP_DATAR15_OFFSET       0x0050
#define CH32V203_BKP_DATAR15              (CH32V203_BKP_BASE + CH32V203_BKP_DATAR15_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR15_D15          (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR15_D15_MASK     (0xffff << 0)
#define CH32V203_BKP_DATAR16_OFFSET       0x0054
#define CH32V203_BKP_DATAR16              (CH32V203_BKP_BASE + CH32V203_BKP_DATAR16_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR16_D16          (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR16_D16_MASK     (0xffff << 0)
#define CH32V203_BKP_DATAR17_OFFSET       0x0058
#define CH32V203_BKP_DATAR17              (CH32V203_BKP_BASE + CH32V203_BKP_DATAR17_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR17_D17          (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR17_D17_MASK     (0xffff << 0)
#define CH32V203_BKP_DATAR18_OFFSET       0x005c
#define CH32V203_BKP_DATAR18              (CH32V203_BKP_BASE + CH32V203_BKP_DATAR18_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR18_D18          (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR18_D18_MASK     (0xffff << 0)
#define CH32V203_BKP_DATAR19_OFFSET       0x0060
#define CH32V203_BKP_DATAR19              (CH32V203_BKP_BASE + CH32V203_BKP_DATAR19_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR19_D19          (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR19_D19_MASK     (0xffff << 0)
#define CH32V203_BKP_DATAR20_OFFSET       0x0064
#define CH32V203_BKP_DATAR20              (CH32V203_BKP_BASE + CH32V203_BKP_DATAR20_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR20_D20          (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR20_D20_MASK     (0xffff << 0)
#define CH32V203_BKP_DATAR21_OFFSET       0x0068
#define CH32V203_BKP_DATAR21              (CH32V203_BKP_BASE + CH32V203_BKP_DATAR21_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR21_D21          (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR21_D21_MASK     (0xffff << 0)
#define CH32V203_BKP_DATAR22_OFFSET       0x006c
#define CH32V203_BKP_DATAR22              (CH32V203_BKP_BASE + CH32V203_BKP_DATAR22_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR22_D22          (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR22_D22_MASK     (0xffff << 0)
#define CH32V203_BKP_DATAR23_OFFSET       0x0070
#define CH32V203_BKP_DATAR23              (CH32V203_BKP_BASE + CH32V203_BKP_DATAR23_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR23_D23          (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR23_D23_MASK     (0xffff << 0)
#define CH32V203_BKP_DATAR24_OFFSET       0x0074
#define CH32V203_BKP_DATAR24              (CH32V203_BKP_BASE + CH32V203_BKP_DATAR24_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR24_D24          (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR24_D24_MASK     (0xffff << 0)
#define CH32V203_BKP_DATAR25_OFFSET       0x0078
#define CH32V203_BKP_DATAR25              (CH32V203_BKP_BASE + CH32V203_BKP_DATAR25_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR25_D25          (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR25_D25_MASK     (0xffff << 0)
#define CH32V203_BKP_DATAR26_OFFSET       0x007c
#define CH32V203_BKP_DATAR26              (CH32V203_BKP_BASE + CH32V203_BKP_DATAR26_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR26_D26          (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR26_D26_MASK     (0xffff << 0)
#define CH32V203_BKP_DATAR27_OFFSET       0x0080
#define CH32V203_BKP_DATAR27              (CH32V203_BKP_BASE + CH32V203_BKP_DATAR27_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR27_D27          (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR27_D27_MASK     (0xffff << 0)
#define CH32V203_BKP_DATAR28_OFFSET       0x0084
#define CH32V203_BKP_DATAR28              (CH32V203_BKP_BASE + CH32V203_BKP_DATAR28_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR28_D28          (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR28_D28_MASK     (0xffff << 0)
#define CH32V203_BKP_DATAR29_OFFSET       0x0088
#define CH32V203_BKP_DATAR29              (CH32V203_BKP_BASE + CH32V203_BKP_DATAR29_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR29_D29          (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR29_D29_MASK     (0xffff << 0)
#define CH32V203_BKP_DATAR30_OFFSET       0x008c
#define CH32V203_BKP_DATAR30              (CH32V203_BKP_BASE + CH32V203_BKP_DATAR30_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR30_D30          (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR30_D30_MASK     (0xffff << 0)
#define CH32V203_BKP_DATAR31_OFFSET       0x0090
#define CH32V203_BKP_DATAR31              (CH32V203_BKP_BASE + CH32V203_BKP_DATAR31_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR31_D31          (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR31_D31_MASK     (0xffff << 0)
#define CH32V203_BKP_DATAR32_OFFSET       0x0094
#define CH32V203_BKP_DATAR32              (CH32V203_BKP_BASE + CH32V203_BKP_DATAR32_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR32_D32          (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR32_D32_MASK     (0xffff << 0)
#define CH32V203_BKP_DATAR33_OFFSET       0x0098
#define CH32V203_BKP_DATAR33              (CH32V203_BKP_BASE + CH32V203_BKP_DATAR33_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR33_D33          (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR33_D33_MASK     (0xffff << 0)
#define CH32V203_BKP_DATAR34_OFFSET       0x009c
#define CH32V203_BKP_DATAR34              (CH32V203_BKP_BASE + CH32V203_BKP_DATAR34_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR34_D34          (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR34_D34_MASK     (0xffff << 0)
#define CH32V203_BKP_DATAR35_OFFSET       0x00a0
#define CH32V203_BKP_DATAR35              (CH32V203_BKP_BASE + CH32V203_BKP_DATAR35_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR35_D35          (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR35_D35_MASK     (0xffff << 0)
#define CH32V203_BKP_DATAR36_OFFSET       0x00a4
#define CH32V203_BKP_DATAR36              (CH32V203_BKP_BASE + CH32V203_BKP_DATAR36_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR36_D36          (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR36_D36_MASK     (0xffff << 0)
#define CH32V203_BKP_DATAR37_OFFSET       0x00a8
#define CH32V203_BKP_DATAR37              (CH32V203_BKP_BASE + CH32V203_BKP_DATAR37_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR37_D37          (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR37_D37_MASK     (0xffff << 0)
#define CH32V203_BKP_DATAR38_OFFSET       0x00ac
#define CH32V203_BKP_DATAR38              (CH32V203_BKP_BASE + CH32V203_BKP_DATAR38_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR38_D38          (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR38_D38_MASK     (0xffff << 0)
#define CH32V203_BKP_DATAR39_OFFSET       0x00b0
#define CH32V203_BKP_DATAR39              (CH32V203_BKP_BASE + CH32V203_BKP_DATAR39_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR39_D39          (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR39_D39_MASK     (0xffff << 0)
#define CH32V203_BKP_DATAR40_OFFSET       0x00b4
#define CH32V203_BKP_DATAR40              (CH32V203_BKP_BASE + CH32V203_BKP_DATAR40_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR40_D40          (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR40_D40_MASK     (0xffff << 0)
#define CH32V203_BKP_DATAR41_OFFSET       0x00b8
#define CH32V203_BKP_DATAR41              (CH32V203_BKP_BASE + CH32V203_BKP_DATAR41_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR41_D41          (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR41_D41_MASK     (0xffff << 0)
#define CH32V203_BKP_DATAR42_OFFSET       0x00bc
#define CH32V203_BKP_DATAR42              (CH32V203_BKP_BASE + CH32V203_BKP_DATAR42_OFFSET) /* read-write */
#define CH32V203_BKP_DATAR42_D42          (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V203_BKP_DATAR42_D42_MASK     (0xffff << 0)
#define CH32V203_BKP_OCTLR_OFFSET         0x002c
#define CH32V203_BKP_OCTLR                (CH32V203_BKP_BASE + CH32V203_BKP_OCTLR_OFFSET) /* read-write */
#define CH32V203_BKP_OCTLR_CAL            (0x7f << 0) /* 0000007f: Calibration value */
#define CH32V203_BKP_OCTLR_CAL_MASK       (0x7f << 0)
#define CH32V203_BKP_OCTLR_CCO            (1 <<  7) /* 00000080: Calibration Clock Output */
#define CH32V203_BKP_OCTLR_ASOE           (1 <<  8) /* 00000100: Alarm or second output enable */
#define CH32V203_BKP_OCTLR_ASOS           (1 <<  9) /* 00000200: Alarm or second output selection */
#define CH32V203_BKP_TPCTLR_OFFSET        0x0030
#define CH32V203_BKP_TPCTLR               (CH32V203_BKP_BASE + CH32V203_BKP_TPCTLR_OFFSET) /* read-write */
#define CH32V203_BKP_TPCTLR_TPE           (1 <<  0) /* 00000001: Tamper pin enable */
#define CH32V203_BKP_TPCTLR_TPAL          (1 <<  1) /* 00000002: Tamper pin active level */
#define CH32V203_BKP_TPCSR_OFFSET         0x0034
#define CH32V203_BKP_TPCSR                (CH32V203_BKP_BASE + CH32V203_BKP_TPCSR_OFFSET)
#define CH32V203_BKP_TPCSR_CTE            (1 <<  0) /* 00000001: Clear Tamper event */
#define CH32V203_BKP_TPCSR_CTI            (1 <<  1) /* 00000002: Clear Tamper Interrupt */
#define CH32V203_BKP_TPCSR_TPIE           (1 <<  2) /* 00000004: Tamper Pin interrupt enable */
#define CH32V203_BKP_TPCSR_TEF            (1 <<  8) /* 00000100: Tamper Event Flag */
#define CH32V203_BKP_TPCSR_TIF            (1 <<  9) /* 00000200: Tamper Interrupt Flag */

/* IWDG - Independent watchdog */
#define CH32V203_IWDG_BASE                0x40003000
#define CH32V203_IWDG_CTLR_OFFSET         0x0000
#define CH32V203_IWDG_CTLR                (CH32V203_IWDG_BASE + CH32V203_IWDG_CTLR_OFFSET) /* write-only */
#define CH32V203_IWDG_CTLR_KEY            (0xffff << 0) /* 0000ffff: Key value */
#define CH32V203_IWDG_CTLR_KEY_MASK       (0xffff << 0)
#define CH32V203_IWDG_PSCR_OFFSET         0x0004
#define CH32V203_IWDG_PSCR                (CH32V203_IWDG_BASE + CH32V203_IWDG_PSCR_OFFSET) /* read-write */
#define CH32V203_IWDG_PSCR_PR             (0x7 << 0) /* 00000007: Prescaler divider */
#define CH32V203_IWDG_PSCR_PR_MASK        (0x7 << 0)
#define CH32V203_IWDG_RLDR_OFFSET         0x0008
#define CH32V203_IWDG_RLDR                (CH32V203_IWDG_BASE + CH32V203_IWDG_RLDR_OFFSET) /* read-write */
#define CH32V203_IWDG_RLDR_RL             (0xfff << 0) /* 00000fff: Watchdog counter reload value */
#define CH32V203_IWDG_RLDR_RL_MASK        (0xfff << 0)
#define CH32V203_IWDG_STATR_OFFSET        0x000c
#define CH32V203_IWDG_STATR               (CH32V203_IWDG_BASE + CH32V203_IWDG_STATR_OFFSET) /* read-only */
#define CH32V203_IWDG_STATR_PVU           (1 <<  0) /* 00000001: Watchdog prescaler value update */
#define CH32V203_IWDG_STATR_RVU           (1 <<  1) /* 00000002: Watchdog counter reload value update */

/* WWDG - Window watchdog */
#define CH32V203_WWDG_BASE                0x40002c00
#define CH32V203_WWDG_CTLR_OFFSET         0x0000
#define CH32V203_WWDG_CTLR                (CH32V203_WWDG_BASE + CH32V203_WWDG_CTLR_OFFSET) /* read-write */
#define CH32V203_WWDG_CTLR_T              (0x7f << 0) /* 0000007f: 7-bit counter (MSB to LSB) */
#define CH32V203_WWDG_CTLR_T_MASK         (0x7f << 0)
#define CH32V203_WWDG_CTLR_WDGA           (1 <<  7) /* 00000080: Activation bit */
#define CH32V203_WWDG_CFGR_OFFSET         0x0004
#define CH32V203_WWDG_CFGR                (CH32V203_WWDG_BASE + CH32V203_WWDG_CFGR_OFFSET) /* read-write */
#define CH32V203_WWDG_CFGR_W              (0x7f << 0) /* 0000007f: 7-bit window value */
#define CH32V203_WWDG_CFGR_W_MASK         (0x7f << 0)
#define CH32V203_WWDG_CFGR_WDGTB          (0x3 << 7) /* 00000180: Timer Base */
#define CH32V203_WWDG_CFGR_WDGTB_MASK     (0x3 << 7)
#define CH32V203_WWDG_CFGR_EWI            (1 <<  9) /* 00000200: Early Wakeup Interrupt */
#define CH32V203_WWDG_STATR_OFFSET        0x0008
#define CH32V203_WWDG_STATR               (CH32V203_WWDG_BASE + CH32V203_WWDG_STATR_OFFSET) /* read-write */
#define CH32V203_WWDG_STATR_WEIF          (1 <<  0) /* 00000001: Early Wakeup Interrupt Flag */

