robertlipe/svdtoheaders/demo/h/ch32v20x_reg.h
/* ADC2 - Analog to digital converter */
#define CH32V203_ADC2_BASE                0x40012800
#define CH32V203_ADC2_STATR_OFFSET        0x0000
#define CH32V203_ADC2_STATR               (CH32V203_ADC2_BASE + CH32V203_ADC2_STATR_OFFSET) /* read-write */
#define CH32V203_ADC2_STATR_STRT          (1 <<  4) /* 00000010: Regular channel start flag */
#define CH32V203_ADC2_STATR_JSTRT         (1 <<  3) /* 00000008: Injected channel start flag */
#define CH32V203_ADC2_STATR_JEOC          (1 <<  2) /* 00000004: Injected channel end of conversion */
#define CH32V203_ADC2_STATR_EOC           (1 <<  1) /* 00000002: Regular channel end of conversion */
#define CH32V203_ADC2_STATR_AWD           (1 <<  0) /* 00000001: Analog watchdog flag */
#define CH32V203_ADC2_CTLR1_OFFSET        0x0004
#define CH32V203_ADC2_CTLR1               (CH32V203_ADC2_BASE + CH32V203_ADC2_CTLR1_OFFSET) /* read-write */
#define CH32V203_ADC2_CTLR1_PGA           (0x3 << 27) /* 18000000: ADC_PGA */
#define CH32V203_ADC2_CTLR1_PGA_MASK      (0x3 << 27)
#define CH32V203_ADC2_CTLR1_BUFEN         (1 << 26) /* 04000000: TKEY_BUF_Enable */
#define CH32V203_ADC2_CTLR1_TKITUNE       (1 << 25) /* 02000000: TKEY_I enable */
#define CH32V203_ADC2_CTLR1_TKEYEN        (1 << 24) /* 01000000: TKEY enable, including TKEY_F and TKEY_V */
#define CH32V203_ADC2_CTLR1_AWDEN         (1 << 23) /* 00800000: Analog watchdog enable on regular channels */
#define CH32V203_ADC2_CTLR1_JAWDEN        (1 << 22) /* 00400000: Analog watchdog enable on injected channels */
#define CH32V203_ADC2_CTLR1_DUALMOD       (0xf << 16) /* 000f0000: Dual mode selection */
#define CH32V203_ADC2_CTLR1_DUALMOD_MASK  (0xf << 16)
#define CH32V203_ADC2_CTLR1_DISCNUM       (0x7 << 13) /* 0000e000: Discontinuous mode channel count */
#define CH32V203_ADC2_CTLR1_DISCNUM_MASK  (0x7 << 13)
#define CH32V203_ADC2_CTLR1_JDISCEN       (1 << 12) /* 00001000: Discontinuous mode on injected channels */
#define CH32V203_ADC2_CTLR1_DISCEN        (1 << 11) /* 00000800: Discontinuous mode on regular channels */
#define CH32V203_ADC2_CTLR1_JAUTO         (1 << 10) /* 00000400: Automatic injected group conversion */
#define CH32V203_ADC2_CTLR1_AWDSGL        (1 <<  9) /* 00000200: Enable the watchdog on a single channel in scan mode */
#define CH32V203_ADC2_CTLR1_SCAN          (1 <<  8) /* 00000100: Scan mode enable */
#define CH32V203_ADC2_CTLR1_JEOCIE        (1 <<  7) /* 00000080: Interrupt enable for injected channels */
#define CH32V203_ADC2_CTLR1_AWDIE         (1 <<  6) /* 00000040: Analog watchdog interrupt enable */
#define CH32V203_ADC2_CTLR1_EOCIE         (1 <<  5) /* 00000020: Interrupt enable for EOC */
#define CH32V203_ADC2_CTLR1_AWDCH         (0x1f << 0) /* 0000001f: Analog watchdog channel select bits */
#define CH32V203_ADC2_CTLR1_AWDCH_MASK    (0x1f << 0)
#define CH32V203_ADC2_CTLR2_OFFSET        0x0008
#define CH32V203_ADC2_CTLR2               (CH32V203_ADC2_BASE + CH32V203_ADC2_CTLR2_OFFSET) /* read-write */
#define CH32V203_ADC2_CTLR2_TSVREFE       (1 << 23) /* 00800000: Temperature sensor and VREFINT enable */
#define CH32V203_ADC2_CTLR2_SWSTART       (1 << 22) /* 00400000: Start conversion of regular channels */
#define CH32V203_ADC2_CTLR2_JSWSTART      (1 << 21) /* 00200000: Start conversion of injected channels */
#define CH32V203_ADC2_CTLR2_EXTTRIG       (1 << 20) /* 00100000: External trigger conversion mode for regular channels */
#define CH32V203_ADC2_CTLR2_EXTSEL        (0x7 << 17) /* 000e0000: External event select for regular group */
#define CH32V203_ADC2_CTLR2_EXTSEL_MASK   (0x7 << 17)
#define CH32V203_ADC2_CTLR2_JEXTTRIG      (1 << 15) /* 00008000: External trigger conversion mode for injected channels */
#define CH32V203_ADC2_CTLR2_JEXTSEL       (0x7 << 12) /* 00007000: External event select for injected group */
#define CH32V203_ADC2_CTLR2_JEXTSEL_MASK  (0x7 << 12)
#define CH32V203_ADC2_CTLR2_ALIGN         (1 << 11) /* 00000800: Data alignment */
#define CH32V203_ADC2_CTLR2_DMA           (1 <<  8) /* 00000100: Direct memory access mode */
#define CH32V203_ADC2_CTLR2_RSTCAL        (1 <<  3) /* 00000008: Reset calibration */
#define CH32V203_ADC2_CTLR2_CAL           (1 <<  2) /* 00000004: A/D calibration */
#define CH32V203_ADC2_CTLR2_CONT          (1 <<  1) /* 00000002: Continuous conversion */
#define CH32V203_ADC2_CTLR2_ADON          (1 <<  0) /* 00000001: A/D converter ON / OFF */
#define CH32V203_ADC2_SAMPTR1_CHARGE1_OFFSET 0x000c
#define CH32V203_ADC2_SAMPTR1_CHARGE1     (CH32V203_ADC2_BASE + CH32V203_ADC2_SAMPTR1_CHARGE1_OFFSET) /* read-write */
#define CH32V203_ADC2_SAMPTR1_CHARGE1_SMP10_TKCG10 (0x7 << 0) /* 00000007: Channel 10 sample time selection */
#define CH32V203_ADC2_SAMPTR1_CHARGE1_SMP10_TKCG10_MASK (0x7 << 0)
#define CH32V203_ADC2_SAMPTR1_CHARGE1_SMP11_TKCG11 (0x7 << 3) /* 00000038: Channel 11 sample time selection */
#define CH32V203_ADC2_SAMPTR1_CHARGE1_SMP11_TKCG11_MASK (0x7 << 3)
#define CH32V203_ADC2_SAMPTR1_CHARGE1_SMP12_TKCG12 (0x7 << 6) /* 000001c0: Channel 12 sample time selection */
#define CH32V203_ADC2_SAMPTR1_CHARGE1_SMP12_TKCG12_MASK (0x7 << 6)
#define CH32V203_ADC2_SAMPTR1_CHARGE1_SMP13_TKCG13 (0x7 << 9) /* 00000e00: Channel 13 sample time selection */
#define CH32V203_ADC2_SAMPTR1_CHARGE1_SMP13_TKCG13_MASK (0x7 << 9)
#define CH32V203_ADC2_SAMPTR1_CHARGE1_SMP14_TKCG14 (0x7 << 12) /* 00007000: Channel 14 sample time selection */
#define CH32V203_ADC2_SAMPTR1_CHARGE1_SMP14_TKCG14_MASK (0x7 << 12)
#define CH32V203_ADC2_SAMPTR1_CHARGE1_SMP15_TKCG15 (0x7 << 15) /* 00038000: Channel 15 sample time selection */
#define CH32V203_ADC2_SAMPTR1_CHARGE1_SMP15_TKCG15_MASK (0x7 << 15)
#define CH32V203_ADC2_SAMPTR1_CHARGE1_SMP16_TKCG16 (0x7 << 18) /* 001c0000: Channel 16 sample time selection */
#define CH32V203_ADC2_SAMPTR1_CHARGE1_SMP16_TKCG16_MASK (0x7 << 18)
#define CH32V203_ADC2_SAMPTR1_CHARGE1_SMP17_TKCG17 (0x7 << 21) /* 00e00000: Channel 17 sample time selection */
#define CH32V203_ADC2_SAMPTR1_CHARGE1_SMP17_TKCG17_MASK (0x7 << 21)
#define CH32V203_ADC2_SAMPTR2_CHARGE2_OFFSET 0x0010
#define CH32V203_ADC2_SAMPTR2_CHARGE2     (CH32V203_ADC2_BASE + CH32V203_ADC2_SAMPTR2_CHARGE2_OFFSET) /* read-write */
#define CH32V203_ADC2_SAMPTR2_CHARGE2_SMP0_TKCG0 (0x7 << 0) /* 00000007: Channel 0 sample time selection */
#define CH32V203_ADC2_SAMPTR2_CHARGE2_SMP0_TKCG0_MASK (0x7 << 0)
#define CH32V203_ADC2_SAMPTR2_CHARGE2_SMP1_TKCG1 (0x7 << 3) /* 00000038: Channel 1 sample time selection */
#define CH32V203_ADC2_SAMPTR2_CHARGE2_SMP1_TKCG1_MASK (0x7 << 3)
#define CH32V203_ADC2_SAMPTR2_CHARGE2_SMP2_TKCG2 (0x7 << 6) /* 000001c0: Channel 2 sample time selection */
#define CH32V203_ADC2_SAMPTR2_CHARGE2_SMP2_TKCG2_MASK (0x7 << 6)
#define CH32V203_ADC2_SAMPTR2_CHARGE2_SMP3_TKCG3 (0x7 << 9) /* 00000e00: Channel 3 sample time selection */
#define CH32V203_ADC2_SAMPTR2_CHARGE2_SMP3_TKCG3_MASK (0x7 << 9)
#define CH32V203_ADC2_SAMPTR2_CHARGE2_SMP4_TKCG4 (0x7 << 12) /* 00007000: Channel 4 sample time selection */
#define CH32V203_ADC2_SAMPTR2_CHARGE2_SMP4_TKCG4_MASK (0x7 << 12)
#define CH32V203_ADC2_SAMPTR2_CHARGE2_SMP5_TKCG5 (0x7 << 15) /* 00038000: Channel 5 sample time selection */
#define CH32V203_ADC2_SAMPTR2_CHARGE2_SMP5_TKCG5_MASK (0x7 << 15)
#define CH32V203_ADC2_SAMPTR2_CHARGE2_SMP6_TKCG6 (0x7 << 18) /* 001c0000: Channel 6 sample time selection */
#define CH32V203_ADC2_SAMPTR2_CHARGE2_SMP6_TKCG6_MASK (0x7 << 18)
#define CH32V203_ADC2_SAMPTR2_CHARGE2_SMP7_TKCG7 (0x7 << 21) /* 00e00000: Channel 7 sample time selection */
#define CH32V203_ADC2_SAMPTR2_CHARGE2_SMP7_TKCG7_MASK (0x7 << 21)
#define CH32V203_ADC2_SAMPTR2_CHARGE2_SMP8_TKCG8 (0x7 << 24) /* 07000000: Channel 8 sample time selection */
#define CH32V203_ADC2_SAMPTR2_CHARGE2_SMP8_TKCG8_MASK (0x7 << 24)
#define CH32V203_ADC2_SAMPTR2_CHARGE2_SMP9_TKCG9 (0x7 << 27) /* 38000000: Channel 9 sample time selection */
#define CH32V203_ADC2_SAMPTR2_CHARGE2_SMP9_TKCG9_MASK (0x7 << 27)
#define CH32V203_ADC2_IOFR1_OFFSET        0x0014
#define CH32V203_ADC2_IOFR1               (CH32V203_ADC2_BASE + CH32V203_ADC2_IOFR1_OFFSET) /* read-write */
#define CH32V203_ADC2_IOFR1_JOFFSET1      (0xfff << 0) /* 00000fff: Data offset for injected channel x */
#define CH32V203_ADC2_IOFR1_JOFFSET1_MASK (0xfff << 0)
#define CH32V203_ADC2_IOFR2_OFFSET        0x0018
#define CH32V203_ADC2_IOFR2               (CH32V203_ADC2_BASE + CH32V203_ADC2_IOFR2_OFFSET) /* read-write */
#define CH32V203_ADC2_IOFR2_JOFFSET2      (0xfff << 0) /* 00000fff: Data offset for injected channel x */
#define CH32V203_ADC2_IOFR2_JOFFSET2_MASK (0xfff << 0)
#define CH32V203_ADC2_IOFR3_OFFSET        0x001c
#define CH32V203_ADC2_IOFR3               (CH32V203_ADC2_BASE + CH32V203_ADC2_IOFR3_OFFSET) /* read-write */
#define CH32V203_ADC2_IOFR3_JOFFSET3      (0xfff << 0) /* 00000fff: Data offset for injected channel x */
#define CH32V203_ADC2_IOFR3_JOFFSET3_MASK (0xfff << 0)
#define CH32V203_ADC2_IOFR4_OFFSET        0x0020
#define CH32V203_ADC2_IOFR4               (CH32V203_ADC2_BASE + CH32V203_ADC2_IOFR4_OFFSET) /* read-write */
#define CH32V203_ADC2_IOFR4_JOFFSET4      (0xfff << 0) /* 00000fff: Data offset for injected channel x */
#define CH32V203_ADC2_IOFR4_JOFFSET4_MASK (0xfff << 0)
#define CH32V203_ADC2_WDHTR_OFFSET        0x0024
#define CH32V203_ADC2_WDHTR               (CH32V203_ADC2_BASE + CH32V203_ADC2_WDHTR_OFFSET) /* read-write */
#define CH32V203_ADC2_WDHTR_HT            (0xfff << 0) /* 00000fff: Analog watchdog higher threshold */
#define CH32V203_ADC2_WDHTR_HT_MASK       (0xfff << 0)
#define CH32V203_ADC2_WDLTR_OFFSET        0x0028
#define CH32V203_ADC2_WDLTR               (CH32V203_ADC2_BASE + CH32V203_ADC2_WDLTR_OFFSET) /* read-write */
#define CH32V203_ADC2_WDLTR_LT            (0xfff << 0) /* 00000fff: Analog watchdog lower threshold */
#define CH32V203_ADC2_WDLTR_LT_MASK       (0xfff << 0)
#define CH32V203_ADC2_RSQR1_OFFSET        0x002c
#define CH32V203_ADC2_RSQR1               (CH32V203_ADC2_BASE + CH32V203_ADC2_RSQR1_OFFSET) /* read-write */
#define CH32V203_ADC2_RSQR1_L             (0xf << 20) /* 00f00000: Regular channel sequence length */
#define CH32V203_ADC2_RSQR1_L_MASK        (0xf << 20)
#define CH32V203_ADC2_RSQR1_SQ16          (0x1f << 15) /* 000f8000: 16th conversion in regular sequence */
#define CH32V203_ADC2_RSQR1_SQ16_MASK     (0x1f << 15)
#define CH32V203_ADC2_RSQR1_SQ15          (0x1f << 10) /* 00007c00: 15th conversion in regular sequence */
#define CH32V203_ADC2_RSQR1_SQ15_MASK     (0x1f << 10)
#define CH32V203_ADC2_RSQR1_SQ14          (0x1f << 5) /* 000003e0: 14th conversion in regular sequence */
#define CH32V203_ADC2_RSQR1_SQ14_MASK     (0x1f << 5)
#define CH32V203_ADC2_RSQR1_SQ13          (0x1f << 0) /* 0000001f: 13th conversion in regular sequence */
#define CH32V203_ADC2_RSQR1_SQ13_MASK     (0x1f << 0)
#define CH32V203_ADC2_RSQR2_OFFSET        0x0030
#define CH32V203_ADC2_RSQR2               (CH32V203_ADC2_BASE + CH32V203_ADC2_RSQR2_OFFSET) /* read-write */
#define CH32V203_ADC2_RSQR2_SQ12          (0x1f << 25) /* 3e000000: 12th conversion in regular sequence */
#define CH32V203_ADC2_RSQR2_SQ12_MASK     (0x1f << 25)
#define CH32V203_ADC2_RSQR2_SQ11          (0x1f << 20) /* 01f00000: 11th conversion in regular sequence */
#define CH32V203_ADC2_RSQR2_SQ11_MASK     (0x1f << 20)
#define CH32V203_ADC2_RSQR2_SQ10          (0x1f << 15) /* 000f8000: 10th conversion in regular sequence */
#define CH32V203_ADC2_RSQR2_SQ10_MASK     (0x1f << 15)
#define CH32V203_ADC2_RSQR2_SQ9           (0x1f << 10) /* 00007c00: 9th conversion in regular sequence */
#define CH32V203_ADC2_RSQR2_SQ9_MASK      (0x1f << 10)
#define CH32V203_ADC2_RSQR2_SQ8           (0x1f << 5) /* 000003e0: 8th conversion in regular sequence */
#define CH32V203_ADC2_RSQR2_SQ8_MASK      (0x1f << 5)
#define CH32V203_ADC2_RSQR2_SQ7           (0x1f << 0) /* 0000001f: 7th conversion in regular sequence */
#define CH32V203_ADC2_RSQR2_SQ7_MASK      (0x1f << 0)
#define CH32V203_ADC2_RSQR3__CHANNEL_OFFSET 0x0034
#define CH32V203_ADC2_RSQR3__CHANNEL      (CH32V203_ADC2_BASE + CH32V203_ADC2_RSQR3__CHANNEL_OFFSET) /* read-write */
#define CH32V203_ADC2_RSQR3__CHANNEL_SQ6  (0x1f << 25) /* 3e000000: 6th conversion in regular sequence */
#define CH32V203_ADC2_RSQR3__CHANNEL_SQ6_MASK (0x1f << 25)
#define CH32V203_ADC2_RSQR3__CHANNEL_SQ5  (0x1f << 20) /* 01f00000: 5th conversion in regular sequence */
#define CH32V203_ADC2_RSQR3__CHANNEL_SQ5_MASK (0x1f << 20)
#define CH32V203_ADC2_RSQR3__CHANNEL_SQ4  (0x1f << 15) /* 000f8000: 4th conversion in regular sequence */
#define CH32V203_ADC2_RSQR3__CHANNEL_SQ4_MASK (0x1f << 15)
#define CH32V203_ADC2_RSQR3__CHANNEL_SQ3  (0x1f << 10) /* 00007c00: 3rd conversion in regular sequence */
#define CH32V203_ADC2_RSQR3__CHANNEL_SQ3_MASK (0x1f << 10)
#define CH32V203_ADC2_RSQR3__CHANNEL_SQ2  (0x1f << 5) /* 000003e0: 2nd conversion in regular sequence */
#define CH32V203_ADC2_RSQR3__CHANNEL_SQ2_MASK (0x1f << 5)
#define CH32V203_ADC2_RSQR3__CHANNEL_SQ1__CHSEL (0x1f << 0) /* 0000001f: 1st conversion in regular sequence;TKDY_V channel select */
#define CH32V203_ADC2_RSQR3__CHANNEL_SQ1__CHSEL_MASK (0x1f << 0)
#define CH32V203_ADC2_ISQR_OFFSET         0x0038
#define CH32V203_ADC2_ISQR                (CH32V203_ADC2_BASE + CH32V203_ADC2_ISQR_OFFSET) /* read-write */
#define CH32V203_ADC2_ISQR_JL             (0x3 << 20) /* 00300000: Injected sequence length */
#define CH32V203_ADC2_ISQR_JL_MASK        (0x3 << 20)
#define CH32V203_ADC2_ISQR_JSQ4           (0x1f << 15) /* 000f8000: 4th conversion in injected sequence */
#define CH32V203_ADC2_ISQR_JSQ4_MASK      (0x1f << 15)
#define CH32V203_ADC2_ISQR_JSQ3           (0x1f << 10) /* 00007c00: 3rd conversion in injected sequence */
#define CH32V203_ADC2_ISQR_JSQ3_MASK      (0x1f << 10)
#define CH32V203_ADC2_ISQR_JSQ2           (0x1f << 5) /* 000003e0: 2nd conversion in injected sequence */
#define CH32V203_ADC2_ISQR_JSQ2_MASK      (0x1f << 5)
#define CH32V203_ADC2_ISQR_JSQ1           (0x1f << 0) /* 0000001f: 1st conversion in injected sequence */
#define CH32V203_ADC2_ISQR_JSQ1_MASK      (0x1f << 0)
#define CH32V203_ADC2_IDATAR1_CHGOFFSET_OFFSET 0x003c
#define CH32V203_ADC2_IDATAR1_CHGOFFSET   (CH32V203_ADC2_BASE + CH32V203_ADC2_IDATAR1_CHGOFFSET_OFFSET) /* read-only */
#define CH32V203_ADC2_IDATAR1_CHGOFFSET_IDATA0_7_TKCGOFFSET (0xff << 0) /* 000000ff: Injected data_Touch key charge data offset for injected channel x */
#define CH32V203_ADC2_IDATAR1_CHGOFFSET_IDATA0_7_TKCGOFFSET_MASK (0xff << 0)
#define CH32V203_ADC2_IDATAR1_CHGOFFSET_IDATA8_15 (0xff << 8) /* 0000ff00: Injected data */
#define CH32V203_ADC2_IDATAR1_CHGOFFSET_IDATA8_15_MASK (0xff << 8)
#define CH32V203_ADC2_IDATAR2_OFFSET      0x0040
#define CH32V203_ADC2_IDATAR2             (CH32V203_ADC2_BASE + CH32V203_ADC2_IDATAR2_OFFSET) /* read-only */
#define CH32V203_ADC2_IDATAR2_JDATA       (0xffff << 0) /* 0000ffff: Injected data */
#define CH32V203_ADC2_IDATAR2_JDATA_MASK  (0xffff << 0)
#define CH32V203_ADC2_IDATAR3_OFFSET      0x0044
#define CH32V203_ADC2_IDATAR3             (CH32V203_ADC2_BASE + CH32V203_ADC2_IDATAR3_OFFSET) /* read-only */
#define CH32V203_ADC2_IDATAR3_JDATA       (0xffff << 0) /* 0000ffff: Injected data */
#define CH32V203_ADC2_IDATAR3_JDATA_MASK  (0xffff << 0)
#define CH32V203_ADC2_IDATAR4_OFFSET      0x0048
#define CH32V203_ADC2_IDATAR4             (CH32V203_ADC2_BASE + CH32V203_ADC2_IDATAR4_OFFSET) /* read-only */
#define CH32V203_ADC2_IDATAR4_JDATA       (0xffff << 0) /* 0000ffff: Injected data */
#define CH32V203_ADC2_IDATAR4_JDATA_MASK  (0xffff << 0)
#define CH32V203_ADC2_RDATAR_DR_ACT_DCG_OFFSET 0x004c
#define CH32V203_ADC2_RDATAR_DR_ACT_DCG   (CH32V203_ADC2_BASE + CH32V203_ADC2_RDATAR_DR_ACT_DCG_OFFSET) /* read-write */
#define CH32V203_ADC2_RDATAR_DR_ACT_DCG_DATA0_7_TKACT_DCG (0xff << 0) /* 000000ff: Regular data_Touch key start and discharge time register */
#define CH32V203_ADC2_RDATAR_DR_ACT_DCG_DATA0_7_TKACT_DCG_MASK (0xff << 0)
#define CH32V203_ADC2_RDATAR_DR_ACT_DCG_DATA8_15 (0xff << 8) /* 0000ff00: Regular data */
#define CH32V203_ADC2_RDATAR_DR_ACT_DCG_DATA8_15_MASK (0xff << 8)

/* DBG - Debug support */
#define CH32V203_DBG_BASE                 0xe000d000
#define CH32V203_DBG_CFGR1_OFFSET         0x0000
#define CH32V203_DBG_CFGR1                (CH32V203_DBG_BASE + CH32V203_DBG_CFGR1_OFFSET) /* read-write */
#define CH32V203_DBG_CFGR1_DEG_IWDG       (1 <<  0) /* 00000001: DEG_IWDG */
#define CH32V203_DBG_CFGR1_DEG_WWDG       (1 <<  1) /* 00000002: DEG_WWDG */
#define CH32V203_DBG_CFGR1_DEG_I2C1       (1 <<  2) /* 00000004: DEG_I2C1 */
#define CH32V203_DBG_CFGR1_DEG_I2C2       (1 <<  3) /* 00000008: DEG_I2C2 */
#define CH32V203_DBG_CFGR1_DEG_TIM1       (1 <<  4) /* 00000010: DEG_TIM1 */
#define CH32V203_DBG_CFGR1_DEG_TIM2       (1 <<  5) /* 00000020: DEG_TIM2 */
#define CH32V203_DBG_CFGR1_DEG_TIM3       (1 <<  6) /* 00000040: DEG_TIM3 */
#define CH32V203_DBG_CFGR1_DEG_TIM4       (1 <<  7) /* 00000080: DEG_TIM4 */
#define CH32V203_DBG_CFGR2_OFFSET         0x0004
#define CH32V203_DBG_CFGR2                (CH32V203_DBG_BASE + CH32V203_DBG_CFGR2_OFFSET) /* read-write */
#define CH32V203_DBG_CFGR2_DBG_SLEEP      (1 <<  0) /* 00000001: DBG_SLEEP */
#define CH32V203_DBG_CFGR2_DBG_STOP       (1 <<  1) /* 00000002: DBG_STOP */
#define CH32V203_DBG_CFGR2_DBG_STANDBY    (1 <<  2) /* 00000004: DBG_STANDBY */

