robertlipe/svdtoheaders/demo/h/ch32v20x_reg.h
/* USBHD - USB register */
#define CH32V203_USBHD_BASE               0x40023400
#define CH32V203_USBHD_USB_CTRL_OFFSET    0x0000
#define CH32V203_USBHD_USB_CTRL           (CH32V203_USBHD_BASE + CH32V203_USBHD_USB_CTRL_OFFSET) /* read-write */
#define CH32V203_USBHD_UHOST_CTRL_OFFSET  0x0001
#define CH32V203_USBHD_UHOST_CTRL         (CH32V203_USBHD_BASE + CH32V203_USBHD_UHOST_CTRL_OFFSET)
#define CH32V203_USBHD_USB_INT_EN_OFFSET  0x0002
#define CH32V203_USBHD_USB_INT_EN         (CH32V203_USBHD_BASE + CH32V203_USBHD_USB_INT_EN_OFFSET) /* read-write */
#define CH32V203_USBHD_USB_DEV_AD_OFFSET  0x0003
#define CH32V203_USBHD_USB_DEV_AD         (CH32V203_USBHD_BASE + CH32V203_USBHD_USB_DEV_AD_OFFSET) /* read-write */
#define CH32V203_USBHD_USB_FRAME_NO_OFFSET 0x0004
#define CH32V203_USBHD_USB_FRAME_NO       (CH32V203_USBHD_BASE + CH32V203_USBHD_USB_FRAME_NO_OFFSET) /* read-only */
#define CH32V203_USBHD_USB_USB_SUSPEND_OFFSET 0x0006
#define CH32V203_USBHD_USB_USB_SUSPEND    (CH32V203_USBHD_BASE + CH32V203_USBHD_USB_USB_SUSPEND_OFFSET) /* read-write */
#define CH32V203_USBHD_USB_SPEED_TYPE_OFFSET 0x0008
#define CH32V203_USBHD_USB_SPEED_TYPE     (CH32V203_USBHD_BASE + CH32V203_USBHD_USB_SPEED_TYPE_OFFSET) /* read-only */
#define CH32V203_USBHD_USB_MIS_ST_OFFSET  0x0009
#define CH32V203_USBHD_USB_MIS_ST         (CH32V203_USBHD_BASE + CH32V203_USBHD_USB_MIS_ST_OFFSET) /* read-only */
#define CH32V203_USBHD_USB_INT_FG_OFFSET  0x000a
#define CH32V203_USBHD_USB_INT_FG         (CH32V203_USBHD_BASE + CH32V203_USBHD_USB_INT_FG_OFFSET)
#define CH32V203_USBHD_USB_INT_ST_OFFSET  0x000b
#define CH32V203_USBHD_USB_INT_ST         (CH32V203_USBHD_BASE + CH32V203_USBHD_USB_INT_ST_OFFSET) /* read-only */
#define CH32V203_USBHD_USB_RX_LEN_OFFSET  0x000c
#define CH32V203_USBHD_USB_RX_LEN         (CH32V203_USBHD_BASE + CH32V203_USBHD_USB_RX_LEN_OFFSET) /* read-only */
#define CH32V203_USBHD_UEP_CONFIG_OFFSET  0x0010
#define CH32V203_USBHD_UEP_CONFIG         (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP_CONFIG_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP_TYPE_OFFSET    0x0014
#define CH32V203_USBHD_UEP_TYPE           (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP_TYPE_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP_BUF_MOD_OFFSET 0x0018
#define CH32V203_USBHD_UEP_BUF_MOD        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP_BUF_MOD_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP0_DMA_OFFSET    0x001c
#define CH32V203_USBHD_UEP0_DMA           (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP0_DMA_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP1_RX_DMA_OFFSET 0x0020
#define CH32V203_USBHD_UEP1_RX_DMA        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP1_RX_DMA_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP2_RX_DMA__UH_RX_DMA_OFFSET 0x0024
#define CH32V203_USBHD_UEP2_RX_DMA__UH_RX_DMA (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP2_RX_DMA__UH_RX_DMA_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP3_RX_DMA_OFFSET 0x0028
#define CH32V203_USBHD_UEP3_RX_DMA        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP3_RX_DMA_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP4_RX_DMA_OFFSET 0x002c
#define CH32V203_USBHD_UEP4_RX_DMA        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP4_RX_DMA_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP5_RX_DMA_OFFSET 0x0030
#define CH32V203_USBHD_UEP5_RX_DMA        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP5_RX_DMA_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP6_RX_DMA_OFFSET 0x0034
#define CH32V203_USBHD_UEP6_RX_DMA        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP6_RX_DMA_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP7_RX_DMA_OFFSET 0x0038
#define CH32V203_USBHD_UEP7_RX_DMA        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP7_RX_DMA_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP8_RX_DMA_OFFSET 0x003c
#define CH32V203_USBHD_UEP8_RX_DMA        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP8_RX_DMA_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP9_RX_DMA_OFFSET 0x0040
#define CH32V203_USBHD_UEP9_RX_DMA        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP9_RX_DMA_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP10_RX_DMA_OFFSET 0x0044
#define CH32V203_USBHD_UEP10_RX_DMA       (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP10_RX_DMA_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP11_RX_DMA_OFFSET 0x0048
#define CH32V203_USBHD_UEP11_RX_DMA       (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP11_RX_DMA_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP12_RX_DMA_OFFSET 0x004c
#define CH32V203_USBHD_UEP12_RX_DMA       (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP12_RX_DMA_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP13_RX_DMA_OFFSET 0x0050
#define CH32V203_USBHD_UEP13_RX_DMA       (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP13_RX_DMA_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP14_RX_DMA_OFFSET 0x0054
#define CH32V203_USBHD_UEP14_RX_DMA       (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP14_RX_DMA_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP15_RX_DMA_OFFSET 0x0058
#define CH32V203_USBHD_UEP15_RX_DMA       (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP15_RX_DMA_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP1_TX_DMA_OFFSET 0x005c
#define CH32V203_USBHD_UEP1_TX_DMA        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP1_TX_DMA_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP2_TX_DMA_OFFSET 0x0060
#define CH32V203_USBHD_UEP2_TX_DMA        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP2_TX_DMA_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP3_TX_DMA__UH_TX_DMA_OFFSET 0x0064
#define CH32V203_USBHD_UEP3_TX_DMA__UH_TX_DMA (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP3_TX_DMA__UH_TX_DMA_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP4_TX_DMA_OFFSET 0x0068
#define CH32V203_USBHD_UEP4_TX_DMA        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP4_TX_DMA_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP5_TX_DMA_OFFSET 0x006c
#define CH32V203_USBHD_UEP5_TX_DMA        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP5_TX_DMA_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP6_TX_DMA_OFFSET 0x0070
#define CH32V203_USBHD_UEP6_TX_DMA        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP6_TX_DMA_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP7_TX_DMA_OFFSET 0x0074
#define CH32V203_USBHD_UEP7_TX_DMA        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP7_TX_DMA_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP8_TX_DMA_OFFSET 0x0078
#define CH32V203_USBHD_UEP8_TX_DMA        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP8_TX_DMA_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP9_TX_DMA_OFFSET 0x007c
#define CH32V203_USBHD_UEP9_TX_DMA        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP9_TX_DMA_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP10_TX_DMA_OFFSET 0x0080
#define CH32V203_USBHD_UEP10_TX_DMA       (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP10_TX_DMA_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP11_TX_DMA_OFFSET 0x0084
#define CH32V203_USBHD_UEP11_TX_DMA       (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP11_TX_DMA_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP12_TX_DMA____UH_SPLIT_DATA_OFFSET 0x0088
#define CH32V203_USBHD_UEP12_TX_DMA____UH_SPLIT_DATA (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP12_TX_DMA____UH_SPLIT_DATA_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP13_TX_DMA_OFFSET 0x008c
#define CH32V203_USBHD_UEP13_TX_DMA       (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP13_TX_DMA_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP14_TX_DMA_OFFSET 0x0090
#define CH32V203_USBHD_UEP14_TX_DMA       (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP14_TX_DMA_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP15_TX_DMA_OFFSET 0x0094
#define CH32V203_USBHD_UEP15_TX_DMA       (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP15_TX_DMA_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP0_MAX_LEN_OFFSET 0x0098
#define CH32V203_USBHD_UEP0_MAX_LEN       (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP0_MAX_LEN_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP1_MAX_LEN_OFFSET 0x009c
#define CH32V203_USBHD_UEP1_MAX_LEN       (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP1_MAX_LEN_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP2_MAX_LEN__UH_RX_MAX_LEN_OFFSET 0x00a0
#define CH32V203_USBHD_UEP2_MAX_LEN__UH_RX_MAX_LEN (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP2_MAX_LEN__UH_RX_MAX_LEN_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP3_MAX_LEN_OFFSET 0x00a4
#define CH32V203_USBHD_UEP3_MAX_LEN       (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP3_MAX_LEN_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP4_MAX_LEN_OFFSET 0x00a8
#define CH32V203_USBHD_UEP4_MAX_LEN       (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP4_MAX_LEN_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP5_MAX_LEN_OFFSET 0x00ac
#define CH32V203_USBHD_UEP5_MAX_LEN       (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP5_MAX_LEN_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP6_MAX_LEN_OFFSET 0x00b0
#define CH32V203_USBHD_UEP6_MAX_LEN       (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP6_MAX_LEN_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP7_MAX_LEN_OFFSET 0x00b4
#define CH32V203_USBHD_UEP7_MAX_LEN       (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP7_MAX_LEN_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP8_MAX_LEN_OFFSET 0x00b8
#define CH32V203_USBHD_UEP8_MAX_LEN       (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP8_MAX_LEN_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP9_MAX_LEN_OFFSET 0x00bc
#define CH32V203_USBHD_UEP9_MAX_LEN       (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP9_MAX_LEN_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP10_MAX_LEN_OFFSET 0x00c0
#define CH32V203_USBHD_UEP10_MAX_LEN      (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP10_MAX_LEN_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP11_MAX_LEN_OFFSET 0x00c4
#define CH32V203_USBHD_UEP11_MAX_LEN      (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP11_MAX_LEN_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP12_MAX_LEN_OFFSET 0x00c8
#define CH32V203_USBHD_UEP12_MAX_LEN      (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP12_MAX_LEN_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP13_MAX_LEN_OFFSET 0x00cc
#define CH32V203_USBHD_UEP13_MAX_LEN      (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP13_MAX_LEN_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP14_MAX_LEN_OFFSET 0x00d0
#define CH32V203_USBHD_UEP14_MAX_LEN      (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP14_MAX_LEN_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP15_MAX_LEN_OFFSET 0x00d4
#define CH32V203_USBHD_UEP15_MAX_LEN      (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP15_MAX_LEN_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP0_T_LEN_OFFSET  0x00d8
#define CH32V203_USBHD_UEP0_T_LEN         (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP0_T_LEN_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP0_T_CTRL_OFFSET 0x00da
#define CH32V203_USBHD_UEP0_T_CTRL        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP0_T_CTRL_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP0_R_CTRL_OFFSET 0x00db
#define CH32V203_USBHD_UEP0_R_CTRL        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP0_R_CTRL_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP1_T_LEN_OFFSET  0x00dc
#define CH32V203_USBHD_UEP1_T_LEN         (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP1_T_LEN_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP1_T_CTRL_OFFSET 0x00de
#define CH32V203_USBHD_UEP1_T_CTRL        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP1_T_CTRL_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP1_R_CTRL_OFFSET 0x00df
#define CH32V203_USBHD_UEP1_R_CTRL        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP1_R_CTRL_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP2_T_LEN__UH_EP_PID_OFFSET 0x00e0
#define CH32V203_USBHD_UEP2_T_LEN__UH_EP_PID (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP2_T_LEN__UH_EP_PID_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP2_T_CTRL_OFFSET 0x00e2
#define CH32V203_USBHD_UEP2_T_CTRL        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP2_T_CTRL_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP2_R_CTRL__UH_RX_CTRL_OFFSET 0x00e3
#define CH32V203_USBHD_UEP2_R_CTRL__UH_RX_CTRL (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP2_R_CTRL__UH_RX_CTRL_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP3_T_LEN___UH_TX_LEN_H_OFFSET 0x00e4
#define CH32V203_USBHD_UEP3_T_LEN___UH_TX_LEN_H (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP3_T_LEN___UH_TX_LEN_H_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP3_T_CTRL___UH_TX_CTRL_OFFSET 0x00e6
#define CH32V203_USBHD_UEP3_T_CTRL___UH_TX_CTRL (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP3_T_CTRL___UH_TX_CTRL_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP3_R_CTRL_OFFSET 0x00e7
#define CH32V203_USBHD_UEP3_R_CTRL        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP3_R_CTRL_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP4_T_LEN_OFFSET  0x00e8
#define CH32V203_USBHD_UEP4_T_LEN         (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP4_T_LEN_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP4_T_CTRL_OFFSET 0x00ea
#define CH32V203_USBHD_UEP4_T_CTRL        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP4_T_CTRL_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP4_R_CTRL_OFFSET 0x00eb
#define CH32V203_USBHD_UEP4_R_CTRL        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP4_R_CTRL_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP5_T_LEN_OFFSET  0x00ec
#define CH32V203_USBHD_UEP5_T_LEN         (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP5_T_LEN_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP5_T_CTRL_OFFSET 0x00ee
#define CH32V203_USBHD_UEP5_T_CTRL        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP5_T_CTRL_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP5_R_CTRL_OFFSET 0x00ef
#define CH32V203_USBHD_UEP5_R_CTRL        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP5_R_CTRL_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP6_T_LEN_OFFSET  0x00f0
#define CH32V203_USBHD_UEP6_T_LEN         (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP6_T_LEN_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP6_T_CTRL_OFFSET 0x00f2
#define CH32V203_USBHD_UEP6_T_CTRL        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP6_T_CTRL_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP6_R_CTRL_OFFSET 0x00f3
#define CH32V203_USBHD_UEP6_R_CTRL        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP6_R_CTRL_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP7_T_LEN_OFFSET  0x00f4
#define CH32V203_USBHD_UEP7_T_LEN         (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP7_T_LEN_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP7_T_CTRL_OFFSET 0x00f6
#define CH32V203_USBHD_UEP7_T_CTRL        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP7_T_CTRL_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP7_R_CTRL_OFFSET 0x00f7
#define CH32V203_USBHD_UEP7_R_CTRL        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP7_R_CTRL_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP8_T_LEN_OFFSET  0x00f8
#define CH32V203_USBHD_UEP8_T_LEN         (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP8_T_LEN_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP8_T_CTRL_OFFSET 0x00fa
#define CH32V203_USBHD_UEP8_T_CTRL        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP8_T_CTRL_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP8_R_CTRL_OFFSET 0x00fb
#define CH32V203_USBHD_UEP8_R_CTRL        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP8_R_CTRL_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP9_T_LEN_OFFSET  0x00fc
#define CH32V203_USBHD_UEP9_T_LEN         (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP9_T_LEN_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP9_T_CTRL_OFFSET 0x00fe
#define CH32V203_USBHD_UEP9_T_CTRL        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP9_T_CTRL_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP9_R_CTRL_OFFSET 0x00ff
#define CH32V203_USBHD_UEP9_R_CTRL        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP9_R_CTRL_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP10_T_LEN_OFFSET 0x0100
#define CH32V203_USBHD_UEP10_T_LEN        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP10_T_LEN_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP10_T_CTRL_OFFSET 0x0102
#define CH32V203_USBHD_UEP10_T_CTRL       (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP10_T_CTRL_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP10_R_CTRL_OFFSET 0x0103
#define CH32V203_USBHD_UEP10_R_CTRL       (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP10_R_CTRL_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP11_T_LEN_OFFSET 0x0104
#define CH32V203_USBHD_UEP11_T_LEN        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP11_T_LEN_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP11_T_CTRL_OFFSET 0x0106
#define CH32V203_USBHD_UEP11_T_CTRL       (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP11_T_CTRL_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP11_R_CTRL_OFFSET 0x0107
#define CH32V203_USBHD_UEP11_R_CTRL       (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP11_R_CTRL_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP12_T_LEN_OFFSET 0x0108
#define CH32V203_USBHD_UEP12_T_LEN        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP12_T_LEN_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP12_T_CTRL_OFFSET 0x010a
#define CH32V203_USBHD_UEP12_T_CTRL       (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP12_T_CTRL_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP12_R_CTRL_OFFSET 0x010b
#define CH32V203_USBHD_UEP12_R_CTRL       (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP12_R_CTRL_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP13_T_LEN_OFFSET 0x010c
#define CH32V203_USBHD_UEP13_T_LEN        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP13_T_LEN_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP13_T_CTRL_OFFSET 0x010e
#define CH32V203_USBHD_UEP13_T_CTRL       (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP13_T_CTRL_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP13_R_CTRL_OFFSET 0x010f
#define CH32V203_USBHD_UEP13_R_CTRL       (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP13_R_CTRL_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP14_T_LEN_OFFSET 0x0110
#define CH32V203_USBHD_UEP14_T_LEN        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP14_T_LEN_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP14_T_CTRL_OFFSET 0x0112
#define CH32V203_USBHD_UEP14_T_CTRL       (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP14_T_CTRL_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP14_R_CTRL_OFFSET 0x0113
#define CH32V203_USBHD_UEP14_R_CTRL       (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP14_R_CTRL_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP15_T_LEN_OFFSET 0x0114
#define CH32V203_USBHD_UEP15_T_LEN        (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP15_T_LEN_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP15_T_CTRL_OFFSET 0x0116
#define CH32V203_USBHD_UEP15_T_CTRL       (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP15_T_CTRL_OFFSET) /* read-write */
#define CH32V203_USBHD_UEP15_R_CTRL_OFFSET 0x0117
#define CH32V203_USBHD_UEP15_R_CTRL       (CH32V203_USBHD_BASE + CH32V203_USBHD_UEP15_R_CTRL_OFFSET) /* read-write */

